HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_reg.h
/**
 * \file IfxDma_reg.h
 * \brief
 * \copyright Copyright (c) 2014 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC27XA_TS_V3.0.1.R2
 * Specification: TC27xA_TS_V3.0.1_SFR_OPEN_MARKET.xml (Revision: V3.0.1)
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Dma_Cfg Dma address
 * \ingroup IfxLld_Dma
 * 
 * \defgroup IfxLld_Dma_Cfg_BaseAddress Base address
 * \ingroup IfxLld_Dma_Cfg
 * 
 * \defgroup IfxLld_Dma_Cfg_Dma 2-DMA
 * \ingroup IfxLld_Dma_Cfg
 * 
 */
#ifndef IFXDMA_REG_H
#define IFXDMA_REG_H 1
/******************************************************************************/
#include "IfxDma_regdef.h"
/******************************************************************************/
/** \addtogroup IfxLld_Dma_Cfg_BaseAddress
 * \{  */

/** \\brief  DMA object */
#define MODULE_DMA /*lint --e(923)*/ ((*(Ifx_DMA*)0xF0014000u))
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Dma_Cfg_Dma
 * \{  */

/** \\brief  8FC, DMA Sub-block Access Enable Register 0 */
#define DMA_BLK0_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_ACCEN0*)0xF00148FCu)

/** Alias (User Manual Name) for DMA_BLK0_ACCEN0.
* To use register names with standard convension, please use DMA_BLK0_ACCEN0.
*/
#define	DMA_ACCEN00	(DMA_BLK0_ACCEN0)

/** \\brief  8F8, DMA Sub-block Access Enable Register 1 */
#define DMA_BLK0_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_ACCEN1*)0xF00148F8u)

/** Alias (User Manual Name) for DMA_BLK0_ACCEN1.
* To use register names with standard convension, please use DMA_BLK0_ACCEN1.
*/
#define	DMA_ACCEN01	(DMA_BLK0_ACCEN1)

/** \\brief  8C, DMA Channel Address Control Register */
#define DMA_BLK0_CH0_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001408Cu)

/** Alias (User Manual Name) for DMA_BLK0_CH0_ADRCR.
* To use register names with standard convension, please use DMA_BLK0_CH0_ADRCR.
*/
#define	DMA_ADRCR000	(DMA_BLK0_CH0_ADRCR)

/** \\brief  84, DMA Channel Control Register */
#define DMA_BLK0_CH0_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0014084u)

/** Alias (User Manual Name) for DMA_BLK0_CH0_CHCR.
* To use register names with standard convension, please use DMA_BLK0_CH0_CHCR.
*/
#define	DMA_CHCR000	(DMA_BLK0_CH0_CHCR)

/** \\brief  88, DMA Channel Interrupt Control Register */
#define DMA_BLK0_CH0_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0014088u)

/** Alias (User Manual Name) for DMA_BLK0_CH0_CHICR.
* To use register names with standard convension, please use DMA_BLK0_CH0_CHICR.
*/
#define	DMA_CHICR000	(DMA_BLK0_CH0_CHICR)

/** \\brief  80, DMA Channel Status Register */
#define DMA_BLK0_CH0_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0014080u)

/** Alias (User Manual Name) for DMA_BLK0_CH0_CHSR.
* To use register names with standard convension, please use DMA_BLK0_CH0_CHSR.
*/
#define	DMA_CHSR000	(DMA_BLK0_CH0_CHSR)

/** \\brief  94, DMA Channel Destination Address Register */
#define DMA_BLK0_CH0_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0014094u)

/** Alias (User Manual Name) for DMA_BLK0_CH0_DADR.
* To use register names with standard convension, please use DMA_BLK0_CH0_DADR.
*/
#define	DMA_DADR000	(DMA_BLK0_CH0_DADR)

/** \\brief  90, DMA Channel Source Address Register */
#define DMA_BLK0_CH0_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0014090u)

/** Alias (User Manual Name) for DMA_BLK0_CH0_SADR.
* To use register names with standard convension, please use DMA_BLK0_CH0_SADR.
*/
#define	DMA_SADR000	(DMA_BLK0_CH0_SADR)

/** \\brief  98, DMA Channel Shadow Address Register */
#define DMA_BLK0_CH0_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0014098u)

/** Alias (User Manual Name) for DMA_BLK0_CH0_SHADR.
* To use register names with standard convension, please use DMA_BLK0_CH0_SHADR.
*/
#define	DMA_SHADR000	(DMA_BLK0_CH0_SHADR)

/** \\brief  1CC, DMA Channel Address Control Register */
#define DMA_BLK0_CH10_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF00141CCu)

/** Alias (User Manual Name) for DMA_BLK0_CH10_ADRCR.
* To use register names with standard convension, please use DMA_BLK0_CH10_ADRCR.
*/
#define	DMA_ADRCR010	(DMA_BLK0_CH10_ADRCR)

/** \\brief  1C4, DMA Channel Control Register */
#define DMA_BLK0_CH10_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF00141C4u)

/** Alias (User Manual Name) for DMA_BLK0_CH10_CHCR.
* To use register names with standard convension, please use DMA_BLK0_CH10_CHCR.
*/
#define	DMA_CHCR010	(DMA_BLK0_CH10_CHCR)

/** \\brief  1C8, DMA Channel Interrupt Control Register */
#define DMA_BLK0_CH10_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF00141C8u)

/** Alias (User Manual Name) for DMA_BLK0_CH10_CHICR.
* To use register names with standard convension, please use DMA_BLK0_CH10_CHICR.
*/
#define	DMA_CHICR010	(DMA_BLK0_CH10_CHICR)

/** \\brief  1C0, DMA Channel Status Register */
#define DMA_BLK0_CH10_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF00141C0u)

/** Alias (User Manual Name) for DMA_BLK0_CH10_CHSR.
* To use register names with standard convension, please use DMA_BLK0_CH10_CHSR.
*/
#define	DMA_CHSR010	(DMA_BLK0_CH10_CHSR)

/** \\brief  1D4, DMA Channel Destination Address Register */
#define DMA_BLK0_CH10_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF00141D4u)

/** Alias (User Manual Name) for DMA_BLK0_CH10_DADR.
* To use register names with standard convension, please use DMA_BLK0_CH10_DADR.
*/
#define	DMA_DADR010	(DMA_BLK0_CH10_DADR)

/** \\brief  1D0, DMA Channel Source Address Register */
#define DMA_BLK0_CH10_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF00141D0u)

/** Alias (User Manual Name) for DMA_BLK0_CH10_SADR.
* To use register names with standard convension, please use DMA_BLK0_CH10_SADR.
*/
#define	DMA_SADR010	(DMA_BLK0_CH10_SADR)

