HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_reg.h
/** \\brief  1D8, DMA Channel Shadow Address Register */
#define DMA_BLK0_CH10_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF00141D8u)

/** Alias (User Manual Name) for DMA_BLK0_CH10_SHADR.
* To use register names with standard convension, please use DMA_BLK0_CH10_SHADR.
*/
#define	DMA_SHADR010	(DMA_BLK0_CH10_SHADR)

/** \\brief  1EC, DMA Channel Address Control Register */
#define DMA_BLK0_CH11_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF00141ECu)

/** Alias (User Manual Name) for DMA_BLK0_CH11_ADRCR.
* To use register names with standard convension, please use DMA_BLK0_CH11_ADRCR.
*/
#define	DMA_ADRCR011	(DMA_BLK0_CH11_ADRCR)

/** \\brief  1E4, DMA Channel Control Register */
#define DMA_BLK0_CH11_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF00141E4u)

/** Alias (User Manual Name) for DMA_BLK0_CH11_CHCR.
* To use register names with standard convension, please use DMA_BLK0_CH11_CHCR.
*/
#define	DMA_CHCR011	(DMA_BLK0_CH11_CHCR)

/** \\brief  1E8, DMA Channel Interrupt Control Register */
#define DMA_BLK0_CH11_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF00141E8u)

/** Alias (User Manual Name) for DMA_BLK0_CH11_CHICR.
* To use register names with standard convension, please use DMA_BLK0_CH11_CHICR.
*/
#define	DMA_CHICR011	(DMA_BLK0_CH11_CHICR)

/** \\brief  1E0, DMA Channel Status Register */
#define DMA_BLK0_CH11_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF00141E0u)

/** Alias (User Manual Name) for DMA_BLK0_CH11_CHSR.
* To use register names with standard convension, please use DMA_BLK0_CH11_CHSR.
*/
#define	DMA_CHSR011	(DMA_BLK0_CH11_CHSR)

/** \\brief  1F4, DMA Channel Destination Address Register */
#define DMA_BLK0_CH11_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF00141F4u)

/** Alias (User Manual Name) for DMA_BLK0_CH11_DADR.
* To use register names with standard convension, please use DMA_BLK0_CH11_DADR.
*/
#define	DMA_DADR011	(DMA_BLK0_CH11_DADR)

/** \\brief  1F0, DMA Channel Source Address Register */
#define DMA_BLK0_CH11_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF00141F0u)

/** Alias (User Manual Name) for DMA_BLK0_CH11_SADR.
* To use register names with standard convension, please use DMA_BLK0_CH11_SADR.
*/
#define	DMA_SADR011	(DMA_BLK0_CH11_SADR)

/** \\brief  1F8, DMA Channel Shadow Address Register */
#define DMA_BLK0_CH11_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF00141F8u)

/** Alias (User Manual Name) for DMA_BLK0_CH11_SHADR.
* To use register names with standard convension, please use DMA_BLK0_CH11_SHADR.
*/
#define	DMA_SHADR011	(DMA_BLK0_CH11_SHADR)

/** \\brief  20C, DMA Channel Address Control Register */
#define DMA_BLK0_CH12_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001420Cu)

/** Alias (User Manual Name) for DMA_BLK0_CH12_ADRCR.
* To use register names with standard convension, please use DMA_BLK0_CH12_ADRCR.
*/
#define	DMA_ADRCR012	(DMA_BLK0_CH12_ADRCR)

/** \\brief  204, DMA Channel Control Register */
#define DMA_BLK0_CH12_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0014204u)

/** Alias (User Manual Name) for DMA_BLK0_CH12_CHCR.
* To use register names with standard convension, please use DMA_BLK0_CH12_CHCR.
*/
#define	DMA_CHCR012	(DMA_BLK0_CH12_CHCR)

/** \\brief  208, DMA Channel Interrupt Control Register */
#define DMA_BLK0_CH12_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0014208u)

/** Alias (User Manual Name) for DMA_BLK0_CH12_CHICR.
* To use register names with standard convension, please use DMA_BLK0_CH12_CHICR.
*/
#define	DMA_CHICR012	(DMA_BLK0_CH12_CHICR)

/** \\brief  200, DMA Channel Status Register */
#define DMA_BLK0_CH12_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0014200u)

/** Alias (User Manual Name) for DMA_BLK0_CH12_CHSR.
* To use register names with standard convension, please use DMA_BLK0_CH12_CHSR.
*/
#define	DMA_CHSR012	(DMA_BLK0_CH12_CHSR)

/** \\brief  214, DMA Channel Destination Address Register */
#define DMA_BLK0_CH12_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0014214u)

/** Alias (User Manual Name) for DMA_BLK0_CH12_DADR.
* To use register names with standard convension, please use DMA_BLK0_CH12_DADR.
*/
#define	DMA_DADR012	(DMA_BLK0_CH12_DADR)

/** \\brief  210, DMA Channel Source Address Register */
#define DMA_BLK0_CH12_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0014210u)

/** Alias (User Manual Name) for DMA_BLK0_CH12_SADR.
* To use register names with standard convension, please use DMA_BLK0_CH12_SADR.
*/
#define	DMA_SADR012	(DMA_BLK0_CH12_SADR)

/** \\brief  218, DMA Channel Shadow Address Register */
#define DMA_BLK0_CH12_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0014218u)

/** Alias (User Manual Name) for DMA_BLK0_CH12_SHADR.
* To use register names with standard convension, please use DMA_BLK0_CH12_SHADR.
*/
#define	DMA_SHADR012	(DMA_BLK0_CH12_SHADR)

/** \\brief  22C, DMA Channel Address Control Register */
#define DMA_BLK0_CH13_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001422Cu)

/** Alias (User Manual Name) for DMA_BLK0_CH13_ADRCR.
* To use register names with standard convension, please use DMA_BLK0_CH13_ADRCR.
*/
#define	DMA_ADRCR013	(DMA_BLK0_CH13_ADRCR)

/** \\brief  224, DMA Channel Control Register */
#define DMA_BLK0_CH13_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0014224u)

/** Alias (User Manual Name) for DMA_BLK0_CH13_CHCR.
* To use register names with standard convension, please use DMA_BLK0_CH13_CHCR.
*/
#define	DMA_CHCR013	(DMA_BLK0_CH13_CHCR)

/** \\brief  228, DMA Channel Interrupt Control Register */
#define DMA_BLK0_CH13_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0014228u)

/** Alias (User Manual Name) for DMA_BLK0_CH13_CHICR.
* To use register names with standard convension, please use DMA_BLK0_CH13_CHICR.
*/
#define	DMA_CHICR013	(DMA_BLK0_CH13_CHICR)

/** \\brief  220, DMA Channel Status Register */
#define DMA_BLK0_CH13_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0014220u)

/** Alias (User Manual Name) for DMA_BLK0_CH13_CHSR.
* To use register names with standard convension, please use DMA_BLK0_CH13_CHSR.
*/
#define	DMA_CHSR013	(DMA_BLK0_CH13_CHSR)

/** \\brief  234, DMA Channel Destination Address Register */
#define DMA_BLK0_CH13_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0014234u)

