HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_BLK0_CH13_DADR.
* To use register names with standard convension, please use DMA_BLK0_CH13_DADR.
*/
#define	DMA_DADR013	(DMA_BLK0_CH13_DADR)

/** \\brief  230, DMA Channel Source Address Register */
#define DMA_BLK0_CH13_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0014230u)

/** Alias (User Manual Name) for DMA_BLK0_CH13_SADR.
* To use register names with standard convension, please use DMA_BLK0_CH13_SADR.
*/
#define	DMA_SADR013	(DMA_BLK0_CH13_SADR)

/** \\brief  238, DMA Channel Shadow Address Register */
#define DMA_BLK0_CH13_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0014238u)

/** Alias (User Manual Name) for DMA_BLK0_CH13_SHADR.
* To use register names with standard convension, please use DMA_BLK0_CH13_SHADR.
*/
#define	DMA_SHADR013	(DMA_BLK0_CH13_SHADR)

/** \\brief  24C, DMA Channel Address Control Register */
#define DMA_BLK0_CH14_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001424Cu)

/** Alias (User Manual Name) for DMA_BLK0_CH14_ADRCR.
* To use register names with standard convension, please use DMA_BLK0_CH14_ADRCR.
*/
#define	DMA_ADRCR014	(DMA_BLK0_CH14_ADRCR)

/** \\brief  244, DMA Channel Control Register */
#define DMA_BLK0_CH14_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0014244u)

/** Alias (User Manual Name) for DMA_BLK0_CH14_CHCR.
* To use register names with standard convension, please use DMA_BLK0_CH14_CHCR.
*/
#define	DMA_CHCR014	(DMA_BLK0_CH14_CHCR)

/** \\brief  248, DMA Channel Interrupt Control Register */
#define DMA_BLK0_CH14_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0014248u)

/** Alias (User Manual Name) for DMA_BLK0_CH14_CHICR.
* To use register names with standard convension, please use DMA_BLK0_CH14_CHICR.
*/
#define	DMA_CHICR014	(DMA_BLK0_CH14_CHICR)

/** \\brief  240, DMA Channel Status Register */
#define DMA_BLK0_CH14_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0014240u)

/** Alias (User Manual Name) for DMA_BLK0_CH14_CHSR.
* To use register names with standard convension, please use DMA_BLK0_CH14_CHSR.
*/
#define	DMA_CHSR014	(DMA_BLK0_CH14_CHSR)

/** \\brief  254, DMA Channel Destination Address Register */
#define DMA_BLK0_CH14_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0014254u)

/** Alias (User Manual Name) for DMA_BLK0_CH14_DADR.
* To use register names with standard convension, please use DMA_BLK0_CH14_DADR.
*/
#define	DMA_DADR014	(DMA_BLK0_CH14_DADR)

/** \\brief  250, DMA Channel Source Address Register */
#define DMA_BLK0_CH14_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0014250u)

/** Alias (User Manual Name) for DMA_BLK0_CH14_SADR.
* To use register names with standard convension, please use DMA_BLK0_CH14_SADR.
*/
#define	DMA_SADR014	(DMA_BLK0_CH14_SADR)

/** \\brief  258, DMA Channel Shadow Address Register */
#define DMA_BLK0_CH14_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0014258u)

/** Alias (User Manual Name) for DMA_BLK0_CH14_SHADR.
* To use register names with standard convension, please use DMA_BLK0_CH14_SHADR.
*/
#define	DMA_SHADR014	(DMA_BLK0_CH14_SHADR)

/** \\brief  26C, DMA Channel Address Control Register */
#define DMA_BLK0_CH15_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001426Cu)

/** Alias (User Manual Name) for DMA_BLK0_CH15_ADRCR.
* To use register names with standard convension, please use DMA_BLK0_CH15_ADRCR.
*/
#define	DMA_ADRCR015	(DMA_BLK0_CH15_ADRCR)

/** \\brief  264, DMA Channel Control Register */
#define DMA_BLK0_CH15_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0014264u)

/** Alias (User Manual Name) for DMA_BLK0_CH15_CHCR.
* To use register names with standard convension, please use DMA_BLK0_CH15_CHCR.
*/
#define	DMA_CHCR015	(DMA_BLK0_CH15_CHCR)

/** \\brief  268, DMA Channel Interrupt Control Register */
#define DMA_BLK0_CH15_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0014268u)

/** Alias (User Manual Name) for DMA_BLK0_CH15_CHICR.
* To use register names with standard convension, please use DMA_BLK0_CH15_CHICR.
*/
#define	DMA_CHICR015	(DMA_BLK0_CH15_CHICR)

/** \\brief  260, DMA Channel Status Register */
#define DMA_BLK0_CH15_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0014260u)

/** Alias (User Manual Name) for DMA_BLK0_CH15_CHSR.
* To use register names with standard convension, please use DMA_BLK0_CH15_CHSR.
*/
#define	DMA_CHSR015	(DMA_BLK0_CH15_CHSR)

/** \\brief  274, DMA Channel Destination Address Register */
#define DMA_BLK0_CH15_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0014274u)

/** Alias (User Manual Name) for DMA_BLK0_CH15_DADR.
* To use register names with standard convension, please use DMA_BLK0_CH15_DADR.
*/
#define	DMA_DADR015	(DMA_BLK0_CH15_DADR)

/** \\brief  270, DMA Channel Source Address Register */
#define DMA_BLK0_CH15_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0014270u)

/** Alias (User Manual Name) for DMA_BLK0_CH15_SADR.
* To use register names with standard convension, please use DMA_BLK0_CH15_SADR.
*/
#define	DMA_SADR015	(DMA_BLK0_CH15_SADR)

/** \\brief  278, DMA Channel Shadow Address Register */
#define DMA_BLK0_CH15_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0014278u)

/** Alias (User Manual Name) for DMA_BLK0_CH15_SHADR.
* To use register names with standard convension, please use DMA_BLK0_CH15_SHADR.
*/
#define	DMA_SHADR015	(DMA_BLK0_CH15_SHADR)

/** \\brief  28C, DMA Channel Address Control Register */
#define DMA_BLK0_CH16_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001428Cu)

/** Alias (User Manual Name) for DMA_BLK0_CH16_ADRCR.
* To use register names with standard convension, please use DMA_BLK0_CH16_ADRCR.
*/
#define	DMA_ADRCR016	(DMA_BLK0_CH16_ADRCR)

/** \\brief  284, DMA Channel Control Register */
#define DMA_BLK0_CH16_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0014284u)

/** Alias (User Manual Name) for DMA_BLK0_CH16_CHCR.
* To use register names with standard convension, please use DMA_BLK0_CH16_CHCR.
*/
#define	DMA_CHCR016	(DMA_BLK0_CH16_CHCR)

/** \\brief  288, DMA Channel Interrupt Control Register */
#define DMA_BLK0_CH16_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0014288u)

