HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_BLK0_CH16_CHICR.
* To use register names with standard convension, please use DMA_BLK0_CH16_CHICR.
*/
#define	DMA_CHICR016	(DMA_BLK0_CH16_CHICR)

/** \\brief  280, DMA Channel Status Register */
#define DMA_BLK0_CH16_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0014280u)

/** Alias (User Manual Name) for DMA_BLK0_CH16_CHSR.
* To use register names with standard convension, please use DMA_BLK0_CH16_CHSR.
*/
#define	DMA_CHSR016	(DMA_BLK0_CH16_CHSR)

/** \\brief  294, DMA Channel Destination Address Register */
#define DMA_BLK0_CH16_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0014294u)

/** Alias (User Manual Name) for DMA_BLK0_CH16_DADR.
* To use register names with standard convension, please use DMA_BLK0_CH16_DADR.
*/
#define	DMA_DADR016	(DMA_BLK0_CH16_DADR)

/** \\brief  290, DMA Channel Source Address Register */
#define DMA_BLK0_CH16_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0014290u)

/** Alias (User Manual Name) for DMA_BLK0_CH16_SADR.
* To use register names with standard convension, please use DMA_BLK0_CH16_SADR.
*/
#define	DMA_SADR016	(DMA_BLK0_CH16_SADR)

/** \\brief  298, DMA Channel Shadow Address Register */
#define DMA_BLK0_CH16_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0014298u)

/** Alias (User Manual Name) for DMA_BLK0_CH16_SHADR.
* To use register names with standard convension, please use DMA_BLK0_CH16_SHADR.
*/
#define	DMA_SHADR016	(DMA_BLK0_CH16_SHADR)

/** \\brief  2AC, DMA Channel Address Control Register */
#define DMA_BLK0_CH17_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF00142ACu)

/** Alias (User Manual Name) for DMA_BLK0_CH17_ADRCR.
* To use register names with standard convension, please use DMA_BLK0_CH17_ADRCR.
*/
#define	DMA_ADRCR017	(DMA_BLK0_CH17_ADRCR)

/** \\brief  2A4, DMA Channel Control Register */
#define DMA_BLK0_CH17_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF00142A4u)

/** Alias (User Manual Name) for DMA_BLK0_CH17_CHCR.
* To use register names with standard convension, please use DMA_BLK0_CH17_CHCR.
*/
#define	DMA_CHCR017	(DMA_BLK0_CH17_CHCR)

/** \\brief  2A8, DMA Channel Interrupt Control Register */
#define DMA_BLK0_CH17_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF00142A8u)

/** Alias (User Manual Name) for DMA_BLK0_CH17_CHICR.
* To use register names with standard convension, please use DMA_BLK0_CH17_CHICR.
*/
#define	DMA_CHICR017	(DMA_BLK0_CH17_CHICR)

/** \\brief  2A0, DMA Channel Status Register */
#define DMA_BLK0_CH17_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF00142A0u)

/** Alias (User Manual Name) for DMA_BLK0_CH17_CHSR.
* To use register names with standard convension, please use DMA_BLK0_CH17_CHSR.
*/
#define	DMA_CHSR017	(DMA_BLK0_CH17_CHSR)

/** \\brief  2B4, DMA Channel Destination Address Register */
#define DMA_BLK0_CH17_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF00142B4u)

/** Alias (User Manual Name) for DMA_BLK0_CH17_DADR.
* To use register names with standard convension, please use DMA_BLK0_CH17_DADR.
*/
#define	DMA_DADR017	(DMA_BLK0_CH17_DADR)

/** \\brief  2B0, DMA Channel Source Address Register */
#define DMA_BLK0_CH17_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF00142B0u)

/** Alias (User Manual Name) for DMA_BLK0_CH17_SADR.
* To use register names with standard convension, please use DMA_BLK0_CH17_SADR.
*/
#define	DMA_SADR017	(DMA_BLK0_CH17_SADR)

/** \\brief  2B8, DMA Channel Shadow Address Register */
#define DMA_BLK0_CH17_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF00142B8u)

/** Alias (User Manual Name) for DMA_BLK0_CH17_SHADR.
* To use register names with standard convension, please use DMA_BLK0_CH17_SHADR.
*/
#define	DMA_SHADR017	(DMA_BLK0_CH17_SHADR)

/** \\brief  2CC, DMA Channel Address Control Register */
#define DMA_BLK0_CH18_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF00142CCu)

/** Alias (User Manual Name) for DMA_BLK0_CH18_ADRCR.
* To use register names with standard convension, please use DMA_BLK0_CH18_ADRCR.
*/
#define	DMA_ADRCR018	(DMA_BLK0_CH18_ADRCR)

/** \\brief  2C4, DMA Channel Control Register */
#define DMA_BLK0_CH18_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF00142C4u)

/** Alias (User Manual Name) for DMA_BLK0_CH18_CHCR.
* To use register names with standard convension, please use DMA_BLK0_CH18_CHCR.
*/
#define	DMA_CHCR018	(DMA_BLK0_CH18_CHCR)

/** \\brief  2C8, DMA Channel Interrupt Control Register */
#define DMA_BLK0_CH18_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF00142C8u)

/** Alias (User Manual Name) for DMA_BLK0_CH18_CHICR.
* To use register names with standard convension, please use DMA_BLK0_CH18_CHICR.
*/
#define	DMA_CHICR018	(DMA_BLK0_CH18_CHICR)

/** \\brief  2C0, DMA Channel Status Register */
#define DMA_BLK0_CH18_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF00142C0u)

/** Alias (User Manual Name) for DMA_BLK0_CH18_CHSR.
* To use register names with standard convension, please use DMA_BLK0_CH18_CHSR.
*/
#define	DMA_CHSR018	(DMA_BLK0_CH18_CHSR)

/** \\brief  2D4, DMA Channel Destination Address Register */
#define DMA_BLK0_CH18_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF00142D4u)

/** Alias (User Manual Name) for DMA_BLK0_CH18_DADR.
* To use register names with standard convension, please use DMA_BLK0_CH18_DADR.
*/
#define	DMA_DADR018	(DMA_BLK0_CH18_DADR)

/** \\brief  2D0, DMA Channel Source Address Register */
#define DMA_BLK0_CH18_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF00142D0u)

/** Alias (User Manual Name) for DMA_BLK0_CH18_SADR.
* To use register names with standard convension, please use DMA_BLK0_CH18_SADR.
*/
#define	DMA_SADR018	(DMA_BLK0_CH18_SADR)

/** \\brief  2D8, DMA Channel Shadow Address Register */
#define DMA_BLK0_CH18_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF00142D8u)

/** Alias (User Manual Name) for DMA_BLK0_CH18_SHADR.
* To use register names with standard convension, please use DMA_BLK0_CH18_SHADR.
*/
#define	DMA_SHADR018	(DMA_BLK0_CH18_SHADR)

/** \\brief  2EC, DMA Channel Address Control Register */
#define DMA_BLK0_CH19_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF00142ECu)

