HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_BLK0_CH19_ADRCR.
* To use register names with standard convension, please use DMA_BLK0_CH19_ADRCR.
*/
#define	DMA_ADRCR019	(DMA_BLK0_CH19_ADRCR)

/** \\brief  2E4, DMA Channel Control Register */
#define DMA_BLK0_CH19_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF00142E4u)

/** Alias (User Manual Name) for DMA_BLK0_CH19_CHCR.
* To use register names with standard convension, please use DMA_BLK0_CH19_CHCR.
*/
#define	DMA_CHCR019	(DMA_BLK0_CH19_CHCR)

/** \\brief  2E8, DMA Channel Interrupt Control Register */
#define DMA_BLK0_CH19_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF00142E8u)

/** Alias (User Manual Name) for DMA_BLK0_CH19_CHICR.
* To use register names with standard convension, please use DMA_BLK0_CH19_CHICR.
*/
#define	DMA_CHICR019	(DMA_BLK0_CH19_CHICR)

/** \\brief  2E0, DMA Channel Status Register */
#define DMA_BLK0_CH19_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF00142E0u)

/** Alias (User Manual Name) for DMA_BLK0_CH19_CHSR.
* To use register names with standard convension, please use DMA_BLK0_CH19_CHSR.
*/
#define	DMA_CHSR019	(DMA_BLK0_CH19_CHSR)

/** \\brief  2F4, DMA Channel Destination Address Register */
#define DMA_BLK0_CH19_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF00142F4u)

/** Alias (User Manual Name) for DMA_BLK0_CH19_DADR.
* To use register names with standard convension, please use DMA_BLK0_CH19_DADR.
*/
#define	DMA_DADR019	(DMA_BLK0_CH19_DADR)

/** \\brief  2F0, DMA Channel Source Address Register */
#define DMA_BLK0_CH19_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF00142F0u)

/** Alias (User Manual Name) for DMA_BLK0_CH19_SADR.
* To use register names with standard convension, please use DMA_BLK0_CH19_SADR.
*/
#define	DMA_SADR019	(DMA_BLK0_CH19_SADR)

/** \\brief  2F8, DMA Channel Shadow Address Register */
#define DMA_BLK0_CH19_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF00142F8u)

/** Alias (User Manual Name) for DMA_BLK0_CH19_SHADR.
* To use register names with standard convension, please use DMA_BLK0_CH19_SHADR.
*/
#define	DMA_SHADR019	(DMA_BLK0_CH19_SHADR)

/** \\brief  AC, DMA Channel Address Control Register */
#define DMA_BLK0_CH1_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF00140ACu)

/** Alias (User Manual Name) for DMA_BLK0_CH1_ADRCR.
* To use register names with standard convension, please use DMA_BLK0_CH1_ADRCR.
*/
#define	DMA_ADRCR001	(DMA_BLK0_CH1_ADRCR)

/** \\brief  A4, DMA Channel Control Register */
#define DMA_BLK0_CH1_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF00140A4u)

/** Alias (User Manual Name) for DMA_BLK0_CH1_CHCR.
* To use register names with standard convension, please use DMA_BLK0_CH1_CHCR.
*/
#define	DMA_CHCR001	(DMA_BLK0_CH1_CHCR)

/** \\brief  A8, DMA Channel Interrupt Control Register */
#define DMA_BLK0_CH1_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF00140A8u)

/** Alias (User Manual Name) for DMA_BLK0_CH1_CHICR.
* To use register names with standard convension, please use DMA_BLK0_CH1_CHICR.
*/
#define	DMA_CHICR001	(DMA_BLK0_CH1_CHICR)

/** \\brief  A0, DMA Channel Status Register */
#define DMA_BLK0_CH1_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF00140A0u)

/** Alias (User Manual Name) for DMA_BLK0_CH1_CHSR.
* To use register names with standard convension, please use DMA_BLK0_CH1_CHSR.
*/
#define	DMA_CHSR001	(DMA_BLK0_CH1_CHSR)

/** \\brief  B4, DMA Channel Destination Address Register */
#define DMA_BLK0_CH1_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF00140B4u)

/** Alias (User Manual Name) for DMA_BLK0_CH1_DADR.
* To use register names with standard convension, please use DMA_BLK0_CH1_DADR.
*/
#define	DMA_DADR001	(DMA_BLK0_CH1_DADR)

/** \\brief  B0, DMA Channel Source Address Register */
#define DMA_BLK0_CH1_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF00140B0u)

/** Alias (User Manual Name) for DMA_BLK0_CH1_SADR.
* To use register names with standard convension, please use DMA_BLK0_CH1_SADR.
*/
#define	DMA_SADR001	(DMA_BLK0_CH1_SADR)

/** \\brief  B8, DMA Channel Shadow Address Register */
#define DMA_BLK0_CH1_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF00140B8u)

/** Alias (User Manual Name) for DMA_BLK0_CH1_SHADR.
* To use register names with standard convension, please use DMA_BLK0_CH1_SHADR.
*/
#define	DMA_SHADR001	(DMA_BLK0_CH1_SHADR)

/** \\brief  30C, DMA Channel Address Control Register */
#define DMA_BLK0_CH20_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001430Cu)

/** Alias (User Manual Name) for DMA_BLK0_CH20_ADRCR.
* To use register names with standard convension, please use DMA_BLK0_CH20_ADRCR.
*/
#define	DMA_ADRCR020	(DMA_BLK0_CH20_ADRCR)

/** \\brief  304, DMA Channel Control Register */
#define DMA_BLK0_CH20_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0014304u)

/** Alias (User Manual Name) for DMA_BLK0_CH20_CHCR.
* To use register names with standard convension, please use DMA_BLK0_CH20_CHCR.
*/
#define	DMA_CHCR020	(DMA_BLK0_CH20_CHCR)

/** \\brief  308, DMA Channel Interrupt Control Register */
#define DMA_BLK0_CH20_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0014308u)

/** Alias (User Manual Name) for DMA_BLK0_CH20_CHICR.
* To use register names with standard convension, please use DMA_BLK0_CH20_CHICR.
*/
#define	DMA_CHICR020	(DMA_BLK0_CH20_CHICR)

/** \\brief  300, DMA Channel Status Register */
#define DMA_BLK0_CH20_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0014300u)

/** Alias (User Manual Name) for DMA_BLK0_CH20_CHSR.
* To use register names with standard convension, please use DMA_BLK0_CH20_CHSR.
*/
#define	DMA_CHSR020	(DMA_BLK0_CH20_CHSR)

/** \\brief  314, DMA Channel Destination Address Register */
#define DMA_BLK0_CH20_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0014314u)

/** Alias (User Manual Name) for DMA_BLK0_CH20_DADR.
* To use register names with standard convension, please use DMA_BLK0_CH20_DADR.
*/
#define	DMA_DADR020	(DMA_BLK0_CH20_DADR)

