HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_reg.h
/** \\brief  310, DMA Channel Source Address Register */
#define DMA_BLK0_CH20_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0014310u)

/** Alias (User Manual Name) for DMA_BLK0_CH20_SADR.
* To use register names with standard convension, please use DMA_BLK0_CH20_SADR.
*/
#define	DMA_SADR020	(DMA_BLK0_CH20_SADR)

/** \\brief  318, DMA Channel Shadow Address Register */
#define DMA_BLK0_CH20_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0014318u)

/** Alias (User Manual Name) for DMA_BLK0_CH20_SHADR.
* To use register names with standard convension, please use DMA_BLK0_CH20_SHADR.
*/
#define	DMA_SHADR020	(DMA_BLK0_CH20_SHADR)

/** \\brief  32C, DMA Channel Address Control Register */
#define DMA_BLK0_CH21_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001432Cu)

/** Alias (User Manual Name) for DMA_BLK0_CH21_ADRCR.
* To use register names with standard convension, please use DMA_BLK0_CH21_ADRCR.
*/
#define	DMA_ADRCR021	(DMA_BLK0_CH21_ADRCR)

/** \\brief  324, DMA Channel Control Register */
#define DMA_BLK0_CH21_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0014324u)

/** Alias (User Manual Name) for DMA_BLK0_CH21_CHCR.
* To use register names with standard convension, please use DMA_BLK0_CH21_CHCR.
*/
#define	DMA_CHCR021	(DMA_BLK0_CH21_CHCR)

/** \\brief  328, DMA Channel Interrupt Control Register */
#define DMA_BLK0_CH21_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0014328u)

/** Alias (User Manual Name) for DMA_BLK0_CH21_CHICR.
* To use register names with standard convension, please use DMA_BLK0_CH21_CHICR.
*/
#define	DMA_CHICR021	(DMA_BLK0_CH21_CHICR)

/** \\brief  320, DMA Channel Status Register */
#define DMA_BLK0_CH21_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0014320u)

/** Alias (User Manual Name) for DMA_BLK0_CH21_CHSR.
* To use register names with standard convension, please use DMA_BLK0_CH21_CHSR.
*/
#define	DMA_CHSR021	(DMA_BLK0_CH21_CHSR)

/** \\brief  334, DMA Channel Destination Address Register */
#define DMA_BLK0_CH21_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0014334u)

/** Alias (User Manual Name) for DMA_BLK0_CH21_DADR.
* To use register names with standard convension, please use DMA_BLK0_CH21_DADR.
*/
#define	DMA_DADR021	(DMA_BLK0_CH21_DADR)

/** \\brief  330, DMA Channel Source Address Register */
#define DMA_BLK0_CH21_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0014330u)

/** Alias (User Manual Name) for DMA_BLK0_CH21_SADR.
* To use register names with standard convension, please use DMA_BLK0_CH21_SADR.
*/
#define	DMA_SADR021	(DMA_BLK0_CH21_SADR)

/** \\brief  338, DMA Channel Shadow Address Register */
#define DMA_BLK0_CH21_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0014338u)

/** Alias (User Manual Name) for DMA_BLK0_CH21_SHADR.
* To use register names with standard convension, please use DMA_BLK0_CH21_SHADR.
*/
#define	DMA_SHADR021	(DMA_BLK0_CH21_SHADR)

/** \\brief  34C, DMA Channel Address Control Register */
#define DMA_BLK0_CH22_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001434Cu)

/** Alias (User Manual Name) for DMA_BLK0_CH22_ADRCR.
* To use register names with standard convension, please use DMA_BLK0_CH22_ADRCR.
*/
#define	DMA_ADRCR022	(DMA_BLK0_CH22_ADRCR)

/** \\brief  344, DMA Channel Control Register */
#define DMA_BLK0_CH22_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0014344u)

/** Alias (User Manual Name) for DMA_BLK0_CH22_CHCR.
* To use register names with standard convension, please use DMA_BLK0_CH22_CHCR.
*/
#define	DMA_CHCR022	(DMA_BLK0_CH22_CHCR)

/** \\brief  348, DMA Channel Interrupt Control Register */
#define DMA_BLK0_CH22_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0014348u)

/** Alias (User Manual Name) for DMA_BLK0_CH22_CHICR.
* To use register names with standard convension, please use DMA_BLK0_CH22_CHICR.
*/
#define	DMA_CHICR022	(DMA_BLK0_CH22_CHICR)

/** \\brief  340, DMA Channel Status Register */
#define DMA_BLK0_CH22_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0014340u)

/** Alias (User Manual Name) for DMA_BLK0_CH22_CHSR.
* To use register names with standard convension, please use DMA_BLK0_CH22_CHSR.
*/
#define	DMA_CHSR022	(DMA_BLK0_CH22_CHSR)

/** \\brief  354, DMA Channel Destination Address Register */
#define DMA_BLK0_CH22_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0014354u)

/** Alias (User Manual Name) for DMA_BLK0_CH22_DADR.
* To use register names with standard convension, please use DMA_BLK0_CH22_DADR.
*/
#define	DMA_DADR022	(DMA_BLK0_CH22_DADR)

/** \\brief  350, DMA Channel Source Address Register */
#define DMA_BLK0_CH22_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0014350u)

/** Alias (User Manual Name) for DMA_BLK0_CH22_SADR.
* To use register names with standard convension, please use DMA_BLK0_CH22_SADR.
*/
#define	DMA_SADR022	(DMA_BLK0_CH22_SADR)

/** \\brief  358, DMA Channel Shadow Address Register */
#define DMA_BLK0_CH22_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0014358u)

/** Alias (User Manual Name) for DMA_BLK0_CH22_SHADR.
* To use register names with standard convension, please use DMA_BLK0_CH22_SHADR.
*/
#define	DMA_SHADR022	(DMA_BLK0_CH22_SHADR)

/** \\brief  36C, DMA Channel Address Control Register */
#define DMA_BLK0_CH23_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001436Cu)

/** Alias (User Manual Name) for DMA_BLK0_CH23_ADRCR.
* To use register names with standard convension, please use DMA_BLK0_CH23_ADRCR.
*/
#define	DMA_ADRCR023	(DMA_BLK0_CH23_ADRCR)

/** \\brief  364, DMA Channel Control Register */
#define DMA_BLK0_CH23_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0014364u)

/** Alias (User Manual Name) for DMA_BLK0_CH23_CHCR.
* To use register names with standard convension, please use DMA_BLK0_CH23_CHCR.
*/
#define	DMA_CHCR023	(DMA_BLK0_CH23_CHCR)

/** \\brief  368, DMA Channel Interrupt Control Register */
#define DMA_BLK0_CH23_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0014368u)

/** Alias (User Manual Name) for DMA_BLK0_CH23_CHICR.
* To use register names with standard convension, please use DMA_BLK0_CH23_CHICR.
*/
#define	DMA_CHICR023	(DMA_BLK0_CH23_CHICR)

