HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_reg.h
/** \\brief  360, DMA Channel Status Register */
#define DMA_BLK0_CH23_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0014360u)

/** Alias (User Manual Name) for DMA_BLK0_CH23_CHSR.
* To use register names with standard convension, please use DMA_BLK0_CH23_CHSR.
*/
#define	DMA_CHSR023	(DMA_BLK0_CH23_CHSR)

/** \\brief  374, DMA Channel Destination Address Register */
#define DMA_BLK0_CH23_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0014374u)

/** Alias (User Manual Name) for DMA_BLK0_CH23_DADR.
* To use register names with standard convension, please use DMA_BLK0_CH23_DADR.
*/
#define	DMA_DADR023	(DMA_BLK0_CH23_DADR)

/** \\brief  370, DMA Channel Source Address Register */
#define DMA_BLK0_CH23_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0014370u)

/** Alias (User Manual Name) for DMA_BLK0_CH23_SADR.
* To use register names with standard convension, please use DMA_BLK0_CH23_SADR.
*/
#define	DMA_SADR023	(DMA_BLK0_CH23_SADR)

/** \\brief  378, DMA Channel Shadow Address Register */
#define DMA_BLK0_CH23_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0014378u)

/** Alias (User Manual Name) for DMA_BLK0_CH23_SHADR.
* To use register names with standard convension, please use DMA_BLK0_CH23_SHADR.
*/
#define	DMA_SHADR023	(DMA_BLK0_CH23_SHADR)

/** \\brief  CC, DMA Channel Address Control Register */
#define DMA_BLK0_CH2_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF00140CCu)

/** Alias (User Manual Name) for DMA_BLK0_CH2_ADRCR.
* To use register names with standard convension, please use DMA_BLK0_CH2_ADRCR.
*/
#define	DMA_ADRCR002	(DMA_BLK0_CH2_ADRCR)

/** \\brief  C4, DMA Channel Control Register */
#define DMA_BLK0_CH2_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF00140C4u)

/** Alias (User Manual Name) for DMA_BLK0_CH2_CHCR.
* To use register names with standard convension, please use DMA_BLK0_CH2_CHCR.
*/
#define	DMA_CHCR002	(DMA_BLK0_CH2_CHCR)

/** \\brief  C8, DMA Channel Interrupt Control Register */
#define DMA_BLK0_CH2_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF00140C8u)

/** Alias (User Manual Name) for DMA_BLK0_CH2_CHICR.
* To use register names with standard convension, please use DMA_BLK0_CH2_CHICR.
*/
#define	DMA_CHICR002	(DMA_BLK0_CH2_CHICR)

/** \\brief  C0, DMA Channel Status Register */
#define DMA_BLK0_CH2_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF00140C0u)

/** Alias (User Manual Name) for DMA_BLK0_CH2_CHSR.
* To use register names with standard convension, please use DMA_BLK0_CH2_CHSR.
*/
#define	DMA_CHSR002	(DMA_BLK0_CH2_CHSR)

/** \\brief  D4, DMA Channel Destination Address Register */
#define DMA_BLK0_CH2_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF00140D4u)

/** Alias (User Manual Name) for DMA_BLK0_CH2_DADR.
* To use register names with standard convension, please use DMA_BLK0_CH2_DADR.
*/
#define	DMA_DADR002	(DMA_BLK0_CH2_DADR)

/** \\brief  D0, DMA Channel Source Address Register */
#define DMA_BLK0_CH2_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF00140D0u)

/** Alias (User Manual Name) for DMA_BLK0_CH2_SADR.
* To use register names with standard convension, please use DMA_BLK0_CH2_SADR.
*/
#define	DMA_SADR002	(DMA_BLK0_CH2_SADR)

/** \\brief  D8, DMA Channel Shadow Address Register */
#define DMA_BLK0_CH2_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF00140D8u)

/** Alias (User Manual Name) for DMA_BLK0_CH2_SHADR.
* To use register names with standard convension, please use DMA_BLK0_CH2_SHADR.
*/
#define	DMA_SHADR002	(DMA_BLK0_CH2_SHADR)

/** \\brief  EC, DMA Channel Address Control Register */
#define DMA_BLK0_CH3_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF00140ECu)

/** Alias (User Manual Name) for DMA_BLK0_CH3_ADRCR.
* To use register names with standard convension, please use DMA_BLK0_CH3_ADRCR.
*/
#define	DMA_ADRCR003	(DMA_BLK0_CH3_ADRCR)

/** \\brief  E4, DMA Channel Control Register */
#define DMA_BLK0_CH3_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF00140E4u)

/** Alias (User Manual Name) for DMA_BLK0_CH3_CHCR.
* To use register names with standard convension, please use DMA_BLK0_CH3_CHCR.
*/
#define	DMA_CHCR003	(DMA_BLK0_CH3_CHCR)

/** \\brief  E8, DMA Channel Interrupt Control Register */
#define DMA_BLK0_CH3_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF00140E8u)

/** Alias (User Manual Name) for DMA_BLK0_CH3_CHICR.
* To use register names with standard convension, please use DMA_BLK0_CH3_CHICR.
*/
#define	DMA_CHICR003	(DMA_BLK0_CH3_CHICR)

/** \\brief  E0, DMA Channel Status Register */
#define DMA_BLK0_CH3_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF00140E0u)

/** Alias (User Manual Name) for DMA_BLK0_CH3_CHSR.
* To use register names with standard convension, please use DMA_BLK0_CH3_CHSR.
*/
#define	DMA_CHSR003	(DMA_BLK0_CH3_CHSR)

/** \\brief  F4, DMA Channel Destination Address Register */
#define DMA_BLK0_CH3_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF00140F4u)

/** Alias (User Manual Name) for DMA_BLK0_CH3_DADR.
* To use register names with standard convension, please use DMA_BLK0_CH3_DADR.
*/
#define	DMA_DADR003	(DMA_BLK0_CH3_DADR)

/** \\brief  F0, DMA Channel Source Address Register */
#define DMA_BLK0_CH3_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF00140F0u)

/** Alias (User Manual Name) for DMA_BLK0_CH3_SADR.
* To use register names with standard convension, please use DMA_BLK0_CH3_SADR.
*/
#define	DMA_SADR003	(DMA_BLK0_CH3_SADR)

/** \\brief  F8, DMA Channel Shadow Address Register */
#define DMA_BLK0_CH3_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF00140F8u)

/** Alias (User Manual Name) for DMA_BLK0_CH3_SHADR.
* To use register names with standard convension, please use DMA_BLK0_CH3_SHADR.
*/
#define	DMA_SHADR003	(DMA_BLK0_CH3_SHADR)

/** \\brief  10C, DMA Channel Address Control Register */
#define DMA_BLK0_CH4_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001410Cu)

/** Alias (User Manual Name) for DMA_BLK0_CH4_ADRCR.
* To use register names with standard convension, please use DMA_BLK0_CH4_ADRCR.
*/
#define	DMA_ADRCR004	(DMA_BLK0_CH4_ADRCR)

/** \\brief  104, DMA Channel Control Register */
#define DMA_BLK0_CH4_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0014104u)

/** Alias (User Manual Name) for DMA_BLK0_CH4_CHCR.
* To use register names with standard convension, please use DMA_BLK0_CH4_CHCR.
*/
#define	DMA_CHCR004	(DMA_BLK0_CH4_CHCR)

/** \\brief  108, DMA Channel Interrupt Control Register */
#define DMA_BLK0_CH4_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0014108u)

/** Alias (User Manual Name) for DMA_BLK0_CH4_CHICR.
* To use register names with standard convension, please use DMA_BLK0_CH4_CHICR.
*/
#define	DMA_CHICR004	(DMA_BLK0_CH4_CHICR)

/** \\brief  100, DMA Channel Status Register */
#define DMA_BLK0_CH4_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0014100u)

/** Alias (User Manual Name) for DMA_BLK0_CH4_CHSR.
* To use register names with standard convension, please use DMA_BLK0_CH4_CHSR.
*/
#define	DMA_CHSR004	(DMA_BLK0_CH4_CHSR)

/** \\brief  114, DMA Channel Destination Address Register */
#define DMA_BLK0_CH4_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0014114u)

/** Alias (User Manual Name) for DMA_BLK0_CH4_DADR.
* To use register names with standard convension, please use DMA_BLK0_CH4_DADR.
*/
#define	DMA_DADR004	(DMA_BLK0_CH4_DADR)

/** \\brief  110, DMA Channel Source Address Register */
#define DMA_BLK0_CH4_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0014110u)

