HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_BLK0_CH4_SADR.
* To use register names with standard convension, please use DMA_BLK0_CH4_SADR.
*/
#define	DMA_SADR004	(DMA_BLK0_CH4_SADR)

/** \\brief  118, DMA Channel Shadow Address Register */
#define DMA_BLK0_CH4_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0014118u)

/** Alias (User Manual Name) for DMA_BLK0_CH4_SHADR.
* To use register names with standard convension, please use DMA_BLK0_CH4_SHADR.
*/
#define	DMA_SHADR004	(DMA_BLK0_CH4_SHADR)

/** \\brief  12C, DMA Channel Address Control Register */
#define DMA_BLK0_CH5_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001412Cu)

/** Alias (User Manual Name) for DMA_BLK0_CH5_ADRCR.
* To use register names with standard convension, please use DMA_BLK0_CH5_ADRCR.
*/
#define	DMA_ADRCR005	(DMA_BLK0_CH5_ADRCR)

/** \\brief  124, DMA Channel Control Register */
#define DMA_BLK0_CH5_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0014124u)

/** Alias (User Manual Name) for DMA_BLK0_CH5_CHCR.
* To use register names with standard convension, please use DMA_BLK0_CH5_CHCR.
*/
#define	DMA_CHCR005	(DMA_BLK0_CH5_CHCR)

/** \\brief  128, DMA Channel Interrupt Control Register */
#define DMA_BLK0_CH5_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0014128u)

/** Alias (User Manual Name) for DMA_BLK0_CH5_CHICR.
* To use register names with standard convension, please use DMA_BLK0_CH5_CHICR.
*/
#define	DMA_CHICR005	(DMA_BLK0_CH5_CHICR)

/** \\brief  120, DMA Channel Status Register */
#define DMA_BLK0_CH5_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0014120u)

/** Alias (User Manual Name) for DMA_BLK0_CH5_CHSR.
* To use register names with standard convension, please use DMA_BLK0_CH5_CHSR.
*/
#define	DMA_CHSR005	(DMA_BLK0_CH5_CHSR)

/** \\brief  134, DMA Channel Destination Address Register */
#define DMA_BLK0_CH5_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0014134u)

/** Alias (User Manual Name) for DMA_BLK0_CH5_DADR.
* To use register names with standard convension, please use DMA_BLK0_CH5_DADR.
*/
#define	DMA_DADR005	(DMA_BLK0_CH5_DADR)

/** \\brief  130, DMA Channel Source Address Register */
#define DMA_BLK0_CH5_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0014130u)

/** Alias (User Manual Name) for DMA_BLK0_CH5_SADR.
* To use register names with standard convension, please use DMA_BLK0_CH5_SADR.
*/
#define	DMA_SADR005	(DMA_BLK0_CH5_SADR)

/** \\brief  138, DMA Channel Shadow Address Register */
#define DMA_BLK0_CH5_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0014138u)

/** Alias (User Manual Name) for DMA_BLK0_CH5_SHADR.
* To use register names with standard convension, please use DMA_BLK0_CH5_SHADR.
*/
#define	DMA_SHADR005	(DMA_BLK0_CH5_SHADR)

/** \\brief  14C, DMA Channel Address Control Register */
#define DMA_BLK0_CH6_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001414Cu)

/** Alias (User Manual Name) for DMA_BLK0_CH6_ADRCR.
* To use register names with standard convension, please use DMA_BLK0_CH6_ADRCR.
*/
#define	DMA_ADRCR006	(DMA_BLK0_CH6_ADRCR)

/** \\brief  144, DMA Channel Control Register */
#define DMA_BLK0_CH6_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0014144u)

/** Alias (User Manual Name) for DMA_BLK0_CH6_CHCR.
* To use register names with standard convension, please use DMA_BLK0_CH6_CHCR.
*/
#define	DMA_CHCR006	(DMA_BLK0_CH6_CHCR)

/** \\brief  148, DMA Channel Interrupt Control Register */
#define DMA_BLK0_CH6_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0014148u)

/** Alias (User Manual Name) for DMA_BLK0_CH6_CHICR.
* To use register names with standard convension, please use DMA_BLK0_CH6_CHICR.
*/
#define	DMA_CHICR006	(DMA_BLK0_CH6_CHICR)

/** \\brief  140, DMA Channel Status Register */
#define DMA_BLK0_CH6_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0014140u)

/** Alias (User Manual Name) for DMA_BLK0_CH6_CHSR.
* To use register names with standard convension, please use DMA_BLK0_CH6_CHSR.
*/
#define	DMA_CHSR006	(DMA_BLK0_CH6_CHSR)

/** \\brief  154, DMA Channel Destination Address Register */
#define DMA_BLK0_CH6_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0014154u)

/** Alias (User Manual Name) for DMA_BLK0_CH6_DADR.
* To use register names with standard convension, please use DMA_BLK0_CH6_DADR.
*/
#define	DMA_DADR006	(DMA_BLK0_CH6_DADR)

/** \\brief  150, DMA Channel Source Address Register */
#define DMA_BLK0_CH6_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0014150u)

/** Alias (User Manual Name) for DMA_BLK0_CH6_SADR.
* To use register names with standard convension, please use DMA_BLK0_CH6_SADR.
*/
#define	DMA_SADR006	(DMA_BLK0_CH6_SADR)

/** \\brief  158, DMA Channel Shadow Address Register */
#define DMA_BLK0_CH6_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0014158u)

/** Alias (User Manual Name) for DMA_BLK0_CH6_SHADR.
* To use register names with standard convension, please use DMA_BLK0_CH6_SHADR.
*/
#define	DMA_SHADR006	(DMA_BLK0_CH6_SHADR)

/** \\brief  16C, DMA Channel Address Control Register */
#define DMA_BLK0_CH7_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001416Cu)

/** Alias (User Manual Name) for DMA_BLK0_CH7_ADRCR.
* To use register names with standard convension, please use DMA_BLK0_CH7_ADRCR.
*/
#define	DMA_ADRCR007	(DMA_BLK0_CH7_ADRCR)

/** \\brief  164, DMA Channel Control Register */
#define DMA_BLK0_CH7_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0014164u)

/** Alias (User Manual Name) for DMA_BLK0_CH7_CHCR.
* To use register names with standard convension, please use DMA_BLK0_CH7_CHCR.
*/
#define	DMA_CHCR007	(DMA_BLK0_CH7_CHCR)

/** \\brief  168, DMA Channel Interrupt Control Register */
#define DMA_BLK0_CH7_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0014168u)

/** Alias (User Manual Name) for DMA_BLK0_CH7_CHICR.
* To use register names with standard convension, please use DMA_BLK0_CH7_CHICR.
*/
#define	DMA_CHICR007	(DMA_BLK0_CH7_CHICR)

/** \\brief  160, DMA Channel Status Register */
#define DMA_BLK0_CH7_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0014160u)

