HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_BLK0_CH7_CHSR.
* To use register names with standard convension, please use DMA_BLK0_CH7_CHSR.
*/
#define	DMA_CHSR007	(DMA_BLK0_CH7_CHSR)

/** \\brief  174, DMA Channel Destination Address Register */
#define DMA_BLK0_CH7_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0014174u)

/** Alias (User Manual Name) for DMA_BLK0_CH7_DADR.
* To use register names with standard convension, please use DMA_BLK0_CH7_DADR.
*/
#define	DMA_DADR007	(DMA_BLK0_CH7_DADR)

/** \\brief  170, DMA Channel Source Address Register */
#define DMA_BLK0_CH7_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0014170u)

/** Alias (User Manual Name) for DMA_BLK0_CH7_SADR.
* To use register names with standard convension, please use DMA_BLK0_CH7_SADR.
*/
#define	DMA_SADR007	(DMA_BLK0_CH7_SADR)

/** \\brief  178, DMA Channel Shadow Address Register */
#define DMA_BLK0_CH7_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0014178u)

/** Alias (User Manual Name) for DMA_BLK0_CH7_SHADR.
* To use register names with standard convension, please use DMA_BLK0_CH7_SHADR.
*/
#define	DMA_SHADR007	(DMA_BLK0_CH7_SHADR)

/** \\brief  18C, DMA Channel Address Control Register */
#define DMA_BLK0_CH8_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001418Cu)

/** Alias (User Manual Name) for DMA_BLK0_CH8_ADRCR.
* To use register names with standard convension, please use DMA_BLK0_CH8_ADRCR.
*/
#define	DMA_ADRCR008	(DMA_BLK0_CH8_ADRCR)

/** \\brief  184, DMA Channel Control Register */
#define DMA_BLK0_CH8_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0014184u)

/** Alias (User Manual Name) for DMA_BLK0_CH8_CHCR.
* To use register names with standard convension, please use DMA_BLK0_CH8_CHCR.
*/
#define	DMA_CHCR008	(DMA_BLK0_CH8_CHCR)

/** \\brief  188, DMA Channel Interrupt Control Register */
#define DMA_BLK0_CH8_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0014188u)

/** Alias (User Manual Name) for DMA_BLK0_CH8_CHICR.
* To use register names with standard convension, please use DMA_BLK0_CH8_CHICR.
*/
#define	DMA_CHICR008	(DMA_BLK0_CH8_CHICR)

/** \\brief  180, DMA Channel Status Register */
#define DMA_BLK0_CH8_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0014180u)

/** Alias (User Manual Name) for DMA_BLK0_CH8_CHSR.
* To use register names with standard convension, please use DMA_BLK0_CH8_CHSR.
*/
#define	DMA_CHSR008	(DMA_BLK0_CH8_CHSR)

/** \\brief  194, DMA Channel Destination Address Register */
#define DMA_BLK0_CH8_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0014194u)

/** Alias (User Manual Name) for DMA_BLK0_CH8_DADR.
* To use register names with standard convension, please use DMA_BLK0_CH8_DADR.
*/
#define	DMA_DADR008	(DMA_BLK0_CH8_DADR)

/** \\brief  190, DMA Channel Source Address Register */
#define DMA_BLK0_CH8_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0014190u)

/** Alias (User Manual Name) for DMA_BLK0_CH8_SADR.
* To use register names with standard convension, please use DMA_BLK0_CH8_SADR.
*/
#define	DMA_SADR008	(DMA_BLK0_CH8_SADR)

/** \\brief  198, DMA Channel Shadow Address Register */
#define DMA_BLK0_CH8_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0014198u)

/** Alias (User Manual Name) for DMA_BLK0_CH8_SHADR.
* To use register names with standard convension, please use DMA_BLK0_CH8_SHADR.
*/
#define	DMA_SHADR008	(DMA_BLK0_CH8_SHADR)

/** \\brief  1AC, DMA Channel Address Control Register */
#define DMA_BLK0_CH9_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF00141ACu)

/** Alias (User Manual Name) for DMA_BLK0_CH9_ADRCR.
* To use register names with standard convension, please use DMA_BLK0_CH9_ADRCR.
*/
#define	DMA_ADRCR009	(DMA_BLK0_CH9_ADRCR)

/** \\brief  1A4, DMA Channel Control Register */
#define DMA_BLK0_CH9_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF00141A4u)

/** Alias (User Manual Name) for DMA_BLK0_CH9_CHCR.
* To use register names with standard convension, please use DMA_BLK0_CH9_CHCR.
*/
#define	DMA_CHCR009	(DMA_BLK0_CH9_CHCR)

/** \\brief  1A8, DMA Channel Interrupt Control Register */
#define DMA_BLK0_CH9_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF00141A8u)

/** Alias (User Manual Name) for DMA_BLK0_CH9_CHICR.
* To use register names with standard convension, please use DMA_BLK0_CH9_CHICR.
*/
#define	DMA_CHICR009	(DMA_BLK0_CH9_CHICR)

/** \\brief  1A0, DMA Channel Status Register */
#define DMA_BLK0_CH9_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF00141A0u)

/** Alias (User Manual Name) for DMA_BLK0_CH9_CHSR.
* To use register names with standard convension, please use DMA_BLK0_CH9_CHSR.
*/
#define	DMA_CHSR009	(DMA_BLK0_CH9_CHSR)

/** \\brief  1B4, DMA Channel Destination Address Register */
#define DMA_BLK0_CH9_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF00141B4u)

/** Alias (User Manual Name) for DMA_BLK0_CH9_DADR.
* To use register names with standard convension, please use DMA_BLK0_CH9_DADR.
*/
#define	DMA_DADR009	(DMA_BLK0_CH9_DADR)

/** \\brief  1B0, DMA Channel Source Address Register */
#define DMA_BLK0_CH9_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF00141B0u)

/** Alias (User Manual Name) for DMA_BLK0_CH9_SADR.
* To use register names with standard convension, please use DMA_BLK0_CH9_SADR.
*/
#define	DMA_SADR009	(DMA_BLK0_CH9_SADR)

/** \\brief  1B8, DMA Channel Shadow Address Register */
#define DMA_BLK0_CH9_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF00141B8u)

/** Alias (User Manual Name) for DMA_BLK0_CH9_SHADR.
* To use register names with standard convension, please use DMA_BLK0_CH9_SHADR.
*/
#define	DMA_SHADR009	(DMA_BLK0_CH9_SHADR)

/** \\brief  70, DMA Channel Interrupt Set Register0 */
#define DMA_BLK0_CHINTR0 /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CHINTR0*)0xF0014070u)

/** Alias (User Manual Name) for DMA_BLK0_CHINTR0.
* To use register names with standard convension, please use DMA_BLK0_CHINTR0.
*/
#define	DMA_CHINTR00	(DMA_BLK0_CHINTR0)

/** \\brief  40, DMA Channel Reset Request Register0 */
#define DMA_BLK0_CHRSTR0 /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CHRSTR0*)0xF0014040u)

/** Alias (User Manual Name) for DMA_BLK0_CHRSTR0.
* To use register names with standard convension, please use DMA_BLK0_CHRSTR0.
*/
#define	DMA_CHRSTR00	(DMA_BLK0_CHRSTR0)

/** \\brief  28, DMA Clear Error Register */
#define DMA_BLK0_CLRE /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CLRE*)0xF0014028u)

/** Alias (User Manual Name) for DMA_BLK0_CLRE.
* To use register names with standard convension, please use DMA_BLK0_CLRE.
*/
#define	DMA_CLRE0	(DMA_BLK0_CLRE)

