HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_reg.h
/** \\brief  20, DMA Enable Error Register */
#define DMA_BLK0_EER /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_EER*)0xF0014020u)

/** Alias (User Manual Name) for DMA_BLK0_EER.
* To use register names with standard convension, please use DMA_BLK0_EER.
*/
#define	DMA_EER0	(DMA_BLK0_EER)

/** \\brief  24, DMA Error Status Register */
#define DMA_BLK0_ERRSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_ERRSR*)0xF0014024u)

/** Alias (User Manual Name) for DMA_BLK0_ERRSR.
* To use register names with standard convension, please use DMA_BLK0_ERRSR.
*/
#define	DMA_ERRSR0	(DMA_BLK0_ERRSR)

/** \\brief  38, DMA Move Engine Interrupt Set Register */
#define DMA_BLK0_ME_INTR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_ME_INTR*)0xF0014038u)

/** Alias (User Manual Name) for DMA_BLK0_ME_INTR.
* To use register names with standard convension, please use DMA_BLK0_ME_INTR.
*/
#define	DMA_ME0INTR	(DMA_BLK0_ME_INTR)

/** \\brief  3C, DMA Move Engine Pattern Read Register */
#define DMA_BLK0_ME_PR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_ME_PR*)0xF001403Cu)

/** Alias (User Manual Name) for DMA_BLK0_ME_PR.
* To use register names with standard convension, please use DMA_BLK0_ME_PR.
*/
#define	DMA_ME0PR	(DMA_BLK0_ME_PR)

/** \\brief  34, DMA Move Engine Read Register */
#define DMA_BLK0_ME_R /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_ME_R*)0xF0014034u)

/** Alias (User Manual Name) for DMA_BLK0_ME_R.
* To use register names with standard convension, please use DMA_BLK0_ME_R.
*/
#define	DMA_ME0R	(DMA_BLK0_ME_R)

/** \\brief  30, DMA Move Engine Status Register */
#define DMA_BLK0_ME_SR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_ME_SR*)0xF0014030u)

/** Alias (User Manual Name) for DMA_BLK0_ME_SR.
* To use register names with standard convension, please use DMA_BLK0_ME_SR.
*/
#define	DMA_ME0SR	(DMA_BLK0_ME_SR)

/** \\brief  68, DMA Suspend Acknowledge Register0 */
#define DMA_BLK0_SUSACR0 /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_SUSACR0*)0xF0014068u)

/** Alias (User Manual Name) for DMA_BLK0_SUSACR0.
* To use register names with standard convension, please use DMA_BLK0_SUSACR0.
*/
#define	DMA_SUSACR00	(DMA_BLK0_SUSACR0)

/** \\brief  60, DMA Suspend Enable Register0 */
#define DMA_BLK0_SUSENR0 /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_SUSENR0*)0xF0014060u)

/** Alias (User Manual Name) for DMA_BLK0_SUSENR0.
* To use register names with standard convension, please use DMA_BLK0_SUSENR0.
*/
#define	DMA_SUSENR00	(DMA_BLK0_SUSENR0)

/** \\brief  18FC, DMA Sub-block Access Enable Register 0 */
#define DMA_BLK1_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_ACCEN0*)0xF00158FCu)

/** Alias (User Manual Name) for DMA_BLK1_ACCEN0.
* To use register names with standard convension, please use DMA_BLK1_ACCEN0.
*/
#define	DMA_ACCEN10	(DMA_BLK1_ACCEN0)

/** \\brief  18F8, DMA Sub-block Access Enable Register 1 */
#define DMA_BLK1_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_ACCEN1*)0xF00158F8u)

/** Alias (User Manual Name) for DMA_BLK1_ACCEN1.
* To use register names with standard convension, please use DMA_BLK1_ACCEN1.
*/
#define	DMA_ACCEN11	(DMA_BLK1_ACCEN1)

/** \\brief  108C, DMA Channel Address Control Register */
#define DMA_BLK1_CH0_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001508Cu)

/** Alias (User Manual Name) for DMA_BLK1_CH0_ADRCR.
* To use register names with standard convension, please use DMA_BLK1_CH0_ADRCR.
*/
#define	DMA_ADRCR100	(DMA_BLK1_CH0_ADRCR)

/** \\brief  1084, DMA Channel Control Register */
#define DMA_BLK1_CH0_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0015084u)

/** Alias (User Manual Name) for DMA_BLK1_CH0_CHCR.
* To use register names with standard convension, please use DMA_BLK1_CH0_CHCR.
*/
#define	DMA_CHCR100	(DMA_BLK1_CH0_CHCR)

/** \\brief  1088, DMA Channel Interrupt Control Register */
#define DMA_BLK1_CH0_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0015088u)

/** Alias (User Manual Name) for DMA_BLK1_CH0_CHICR.
* To use register names with standard convension, please use DMA_BLK1_CH0_CHICR.
*/
#define	DMA_CHICR100	(DMA_BLK1_CH0_CHICR)

/** \\brief  1080, DMA Channel Status Register */
#define DMA_BLK1_CH0_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0015080u)

/** Alias (User Manual Name) for DMA_BLK1_CH0_CHSR.
* To use register names with standard convension, please use DMA_BLK1_CH0_CHSR.
*/
#define	DMA_CHSR100	(DMA_BLK1_CH0_CHSR)

/** \\brief  1094, DMA Channel Destination Address Register */
#define DMA_BLK1_CH0_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0015094u)

/** Alias (User Manual Name) for DMA_BLK1_CH0_DADR.
* To use register names with standard convension, please use DMA_BLK1_CH0_DADR.
*/
#define	DMA_DADR100	(DMA_BLK1_CH0_DADR)

/** \\brief  1090, DMA Channel Source Address Register */
#define DMA_BLK1_CH0_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0015090u)

/** Alias (User Manual Name) for DMA_BLK1_CH0_SADR.
* To use register names with standard convension, please use DMA_BLK1_CH0_SADR.
*/
#define	DMA_SADR100	(DMA_BLK1_CH0_SADR)

/** \\brief  1098, DMA Channel Shadow Address Register */
#define DMA_BLK1_CH0_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0015098u)

/** Alias (User Manual Name) for DMA_BLK1_CH0_SHADR.
* To use register names with standard convension, please use DMA_BLK1_CH0_SHADR.
*/
#define	DMA_SHADR100	(DMA_BLK1_CH0_SHADR)

/** \\brief  11CC, DMA Channel Address Control Register */
#define DMA_BLK1_CH10_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF00151CCu)

/** Alias (User Manual Name) for DMA_BLK1_CH10_ADRCR.
* To use register names with standard convension, please use DMA_BLK1_CH10_ADRCR.
*/
#define	DMA_ADRCR110	(DMA_BLK1_CH10_ADRCR)

/** \\brief  11C4, DMA Channel Control Register */
#define DMA_BLK1_CH10_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF00151C4u)

/** Alias (User Manual Name) for DMA_BLK1_CH10_CHCR.
* To use register names with standard convension, please use DMA_BLK1_CH10_CHCR.
*/
#define	DMA_CHCR110	(DMA_BLK1_CH10_CHCR)

/** \\brief  11C8, DMA Channel Interrupt Control Register */
#define DMA_BLK1_CH10_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF00151C8u)

/** Alias (User Manual Name) for DMA_BLK1_CH10_CHICR.
* To use register names with standard convension, please use DMA_BLK1_CH10_CHICR.
*/
#define	DMA_CHICR110	(DMA_BLK1_CH10_CHICR)

/** \\brief  11C0, DMA Channel Status Register */
#define DMA_BLK1_CH10_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF00151C0u)

/** Alias (User Manual Name) for DMA_BLK1_CH10_CHSR.
* To use register names with standard convension, please use DMA_BLK1_CH10_CHSR.
*/
#define	DMA_CHSR110	(DMA_BLK1_CH10_CHSR)

/** \\brief  11D4, DMA Channel Destination Address Register */
#define DMA_BLK1_CH10_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF00151D4u)

/** Alias (User Manual Name) for DMA_BLK1_CH10_DADR.
* To use register names with standard convension, please use DMA_BLK1_CH10_DADR.
*/
#define	DMA_DADR110	(DMA_BLK1_CH10_DADR)

