HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_reg.h
/** \\brief  11D0, DMA Channel Source Address Register */
#define DMA_BLK1_CH10_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF00151D0u)

/** Alias (User Manual Name) for DMA_BLK1_CH10_SADR.
* To use register names with standard convension, please use DMA_BLK1_CH10_SADR.
*/
#define	DMA_SADR110	(DMA_BLK1_CH10_SADR)

/** \\brief  11D8, DMA Channel Shadow Address Register */
#define DMA_BLK1_CH10_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF00151D8u)

/** Alias (User Manual Name) for DMA_BLK1_CH10_SHADR.
* To use register names with standard convension, please use DMA_BLK1_CH10_SHADR.
*/
#define	DMA_SHADR110	(DMA_BLK1_CH10_SHADR)

/** \\brief  11EC, DMA Channel Address Control Register */
#define DMA_BLK1_CH11_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF00151ECu)

/** Alias (User Manual Name) for DMA_BLK1_CH11_ADRCR.
* To use register names with standard convension, please use DMA_BLK1_CH11_ADRCR.
*/
#define	DMA_ADRCR111	(DMA_BLK1_CH11_ADRCR)

/** \\brief  11E4, DMA Channel Control Register */
#define DMA_BLK1_CH11_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF00151E4u)

/** Alias (User Manual Name) for DMA_BLK1_CH11_CHCR.
* To use register names with standard convension, please use DMA_BLK1_CH11_CHCR.
*/
#define	DMA_CHCR111	(DMA_BLK1_CH11_CHCR)

/** \\brief  11E8, DMA Channel Interrupt Control Register */
#define DMA_BLK1_CH11_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF00151E8u)

/** Alias (User Manual Name) for DMA_BLK1_CH11_CHICR.
* To use register names with standard convension, please use DMA_BLK1_CH11_CHICR.
*/
#define	DMA_CHICR111	(DMA_BLK1_CH11_CHICR)

/** \\brief  11E0, DMA Channel Status Register */
#define DMA_BLK1_CH11_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF00151E0u)

/** Alias (User Manual Name) for DMA_BLK1_CH11_CHSR.
* To use register names with standard convension, please use DMA_BLK1_CH11_CHSR.
*/
#define	DMA_CHSR111	(DMA_BLK1_CH11_CHSR)

/** \\brief  11F4, DMA Channel Destination Address Register */
#define DMA_BLK1_CH11_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF00151F4u)

/** Alias (User Manual Name) for DMA_BLK1_CH11_DADR.
* To use register names with standard convension, please use DMA_BLK1_CH11_DADR.
*/
#define	DMA_DADR111	(DMA_BLK1_CH11_DADR)

/** \\brief  11F0, DMA Channel Source Address Register */
#define DMA_BLK1_CH11_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF00151F0u)

/** Alias (User Manual Name) for DMA_BLK1_CH11_SADR.
* To use register names with standard convension, please use DMA_BLK1_CH11_SADR.
*/
#define	DMA_SADR111	(DMA_BLK1_CH11_SADR)

/** \\brief  11F8, DMA Channel Shadow Address Register */
#define DMA_BLK1_CH11_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF00151F8u)

/** Alias (User Manual Name) for DMA_BLK1_CH11_SHADR.
* To use register names with standard convension, please use DMA_BLK1_CH11_SHADR.
*/
#define	DMA_SHADR111	(DMA_BLK1_CH11_SHADR)

/** \\brief  120C, DMA Channel Address Control Register */
#define DMA_BLK1_CH12_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001520Cu)

/** Alias (User Manual Name) for DMA_BLK1_CH12_ADRCR.
* To use register names with standard convension, please use DMA_BLK1_CH12_ADRCR.
*/
#define	DMA_ADRCR112	(DMA_BLK1_CH12_ADRCR)

/** \\brief  1204, DMA Channel Control Register */
#define DMA_BLK1_CH12_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0015204u)

/** Alias (User Manual Name) for DMA_BLK1_CH12_CHCR.
* To use register names with standard convension, please use DMA_BLK1_CH12_CHCR.
*/
#define	DMA_CHCR112	(DMA_BLK1_CH12_CHCR)

/** \\brief  1208, DMA Channel Interrupt Control Register */
#define DMA_BLK1_CH12_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0015208u)

/** Alias (User Manual Name) for DMA_BLK1_CH12_CHICR.
* To use register names with standard convension, please use DMA_BLK1_CH12_CHICR.
*/
#define	DMA_CHICR112	(DMA_BLK1_CH12_CHICR)

/** \\brief  1200, DMA Channel Status Register */
#define DMA_BLK1_CH12_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0015200u)

/** Alias (User Manual Name) for DMA_BLK1_CH12_CHSR.
* To use register names with standard convension, please use DMA_BLK1_CH12_CHSR.
*/
#define	DMA_CHSR112	(DMA_BLK1_CH12_CHSR)

/** \\brief  1214, DMA Channel Destination Address Register */
#define DMA_BLK1_CH12_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0015214u)

/** Alias (User Manual Name) for DMA_BLK1_CH12_DADR.
* To use register names with standard convension, please use DMA_BLK1_CH12_DADR.
*/
#define	DMA_DADR112	(DMA_BLK1_CH12_DADR)

/** \\brief  1210, DMA Channel Source Address Register */
#define DMA_BLK1_CH12_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0015210u)

/** Alias (User Manual Name) for DMA_BLK1_CH12_SADR.
* To use register names with standard convension, please use DMA_BLK1_CH12_SADR.
*/
#define	DMA_SADR112	(DMA_BLK1_CH12_SADR)

/** \\brief  1218, DMA Channel Shadow Address Register */
#define DMA_BLK1_CH12_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0015218u)

/** Alias (User Manual Name) for DMA_BLK1_CH12_SHADR.
* To use register names with standard convension, please use DMA_BLK1_CH12_SHADR.
*/
#define	DMA_SHADR112	(DMA_BLK1_CH12_SHADR)

/** \\brief  122C, DMA Channel Address Control Register */
#define DMA_BLK1_CH13_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001522Cu)

/** Alias (User Manual Name) for DMA_BLK1_CH13_ADRCR.
* To use register names with standard convension, please use DMA_BLK1_CH13_ADRCR.
*/
#define	DMA_ADRCR113	(DMA_BLK1_CH13_ADRCR)

/** \\brief  1224, DMA Channel Control Register */
#define DMA_BLK1_CH13_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0015224u)

/** Alias (User Manual Name) for DMA_BLK1_CH13_CHCR.
* To use register names with standard convension, please use DMA_BLK1_CH13_CHCR.
*/
#define	DMA_CHCR113	(DMA_BLK1_CH13_CHCR)

/** \\brief  1228, DMA Channel Interrupt Control Register */
#define DMA_BLK1_CH13_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0015228u)

/** Alias (User Manual Name) for DMA_BLK1_CH13_CHICR.
* To use register names with standard convension, please use DMA_BLK1_CH13_CHICR.
*/
#define	DMA_CHICR113	(DMA_BLK1_CH13_CHICR)

