HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_reg.h
/** \\brief  1220, DMA Channel Status Register */
#define DMA_BLK1_CH13_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0015220u)

/** Alias (User Manual Name) for DMA_BLK1_CH13_CHSR.
* To use register names with standard convension, please use DMA_BLK1_CH13_CHSR.
*/
#define	DMA_CHSR113	(DMA_BLK1_CH13_CHSR)

/** \\brief  1234, DMA Channel Destination Address Register */
#define DMA_BLK1_CH13_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0015234u)

/** Alias (User Manual Name) for DMA_BLK1_CH13_DADR.
* To use register names with standard convension, please use DMA_BLK1_CH13_DADR.
*/
#define	DMA_DADR113	(DMA_BLK1_CH13_DADR)

/** \\brief  1230, DMA Channel Source Address Register */
#define DMA_BLK1_CH13_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0015230u)

/** Alias (User Manual Name) for DMA_BLK1_CH13_SADR.
* To use register names with standard convension, please use DMA_BLK1_CH13_SADR.
*/
#define	DMA_SADR113	(DMA_BLK1_CH13_SADR)

/** \\brief  1238, DMA Channel Shadow Address Register */
#define DMA_BLK1_CH13_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0015238u)

/** Alias (User Manual Name) for DMA_BLK1_CH13_SHADR.
* To use register names with standard convension, please use DMA_BLK1_CH13_SHADR.
*/
#define	DMA_SHADR113	(DMA_BLK1_CH13_SHADR)

/** \\brief  124C, DMA Channel Address Control Register */
#define DMA_BLK1_CH14_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001524Cu)

/** Alias (User Manual Name) for DMA_BLK1_CH14_ADRCR.
* To use register names with standard convension, please use DMA_BLK1_CH14_ADRCR.
*/
#define	DMA_ADRCR114	(DMA_BLK1_CH14_ADRCR)

/** \\brief  1244, DMA Channel Control Register */
#define DMA_BLK1_CH14_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0015244u)

/** Alias (User Manual Name) for DMA_BLK1_CH14_CHCR.
* To use register names with standard convension, please use DMA_BLK1_CH14_CHCR.
*/
#define	DMA_CHCR114	(DMA_BLK1_CH14_CHCR)

/** \\brief  1248, DMA Channel Interrupt Control Register */
#define DMA_BLK1_CH14_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0015248u)

/** Alias (User Manual Name) for DMA_BLK1_CH14_CHICR.
* To use register names with standard convension, please use DMA_BLK1_CH14_CHICR.
*/
#define	DMA_CHICR114	(DMA_BLK1_CH14_CHICR)

/** \\brief  1240, DMA Channel Status Register */
#define DMA_BLK1_CH14_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0015240u)

/** Alias (User Manual Name) for DMA_BLK1_CH14_CHSR.
* To use register names with standard convension, please use DMA_BLK1_CH14_CHSR.
*/
#define	DMA_CHSR114	(DMA_BLK1_CH14_CHSR)

/** \\brief  1254, DMA Channel Destination Address Register */
#define DMA_BLK1_CH14_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0015254u)

/** Alias (User Manual Name) for DMA_BLK1_CH14_DADR.
* To use register names with standard convension, please use DMA_BLK1_CH14_DADR.
*/
#define	DMA_DADR114	(DMA_BLK1_CH14_DADR)

/** \\brief  1250, DMA Channel Source Address Register */
#define DMA_BLK1_CH14_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0015250u)

/** Alias (User Manual Name) for DMA_BLK1_CH14_SADR.
* To use register names with standard convension, please use DMA_BLK1_CH14_SADR.
*/
#define	DMA_SADR114	(DMA_BLK1_CH14_SADR)

/** \\brief  1258, DMA Channel Shadow Address Register */
#define DMA_BLK1_CH14_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0015258u)

/** Alias (User Manual Name) for DMA_BLK1_CH14_SHADR.
* To use register names with standard convension, please use DMA_BLK1_CH14_SHADR.
*/
#define	DMA_SHADR114	(DMA_BLK1_CH14_SHADR)

/** \\brief  126C, DMA Channel Address Control Register */
#define DMA_BLK1_CH15_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001526Cu)

/** Alias (User Manual Name) for DMA_BLK1_CH15_ADRCR.
* To use register names with standard convension, please use DMA_BLK1_CH15_ADRCR.
*/
#define	DMA_ADRCR115	(DMA_BLK1_CH15_ADRCR)

/** \\brief  1264, DMA Channel Control Register */
#define DMA_BLK1_CH15_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0015264u)

/** Alias (User Manual Name) for DMA_BLK1_CH15_CHCR.
* To use register names with standard convension, please use DMA_BLK1_CH15_CHCR.
*/
#define	DMA_CHCR115	(DMA_BLK1_CH15_CHCR)

/** \\brief  1268, DMA Channel Interrupt Control Register */
#define DMA_BLK1_CH15_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0015268u)

/** Alias (User Manual Name) for DMA_BLK1_CH15_CHICR.
* To use register names with standard convension, please use DMA_BLK1_CH15_CHICR.
*/
#define	DMA_CHICR115	(DMA_BLK1_CH15_CHICR)

/** \\brief  1260, DMA Channel Status Register */
#define DMA_BLK1_CH15_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0015260u)

/** Alias (User Manual Name) for DMA_BLK1_CH15_CHSR.
* To use register names with standard convension, please use DMA_BLK1_CH15_CHSR.
*/
#define	DMA_CHSR115	(DMA_BLK1_CH15_CHSR)

/** \\brief  1274, DMA Channel Destination Address Register */
#define DMA_BLK1_CH15_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0015274u)

/** Alias (User Manual Name) for DMA_BLK1_CH15_DADR.
* To use register names with standard convension, please use DMA_BLK1_CH15_DADR.
*/
#define	DMA_DADR115	(DMA_BLK1_CH15_DADR)

/** \\brief  1270, DMA Channel Source Address Register */
#define DMA_BLK1_CH15_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0015270u)

/** Alias (User Manual Name) for DMA_BLK1_CH15_SADR.
* To use register names with standard convension, please use DMA_BLK1_CH15_SADR.
*/
#define	DMA_SADR115	(DMA_BLK1_CH15_SADR)

/** \\brief  1278, DMA Channel Shadow Address Register */
#define DMA_BLK1_CH15_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0015278u)

/** Alias (User Manual Name) for DMA_BLK1_CH15_SHADR.
* To use register names with standard convension, please use DMA_BLK1_CH15_SHADR.
*/
#define	DMA_SHADR115	(DMA_BLK1_CH15_SHADR)

/** \\brief  128C, DMA Channel Address Control Register */
#define DMA_BLK1_CH16_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001528Cu)

/** Alias (User Manual Name) for DMA_BLK1_CH16_ADRCR.
* To use register names with standard convension, please use DMA_BLK1_CH16_ADRCR.
*/
#define	DMA_ADRCR116	(DMA_BLK1_CH16_ADRCR)

/** \\brief  1284, DMA Channel Control Register */
#define DMA_BLK1_CH16_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0015284u)

/** Alias (User Manual Name) for DMA_BLK1_CH16_CHCR.
* To use register names with standard convension, please use DMA_BLK1_CH16_CHCR.
*/
#define	DMA_CHCR116	(DMA_BLK1_CH16_CHCR)

/** \\brief  1288, DMA Channel Interrupt Control Register */
#define DMA_BLK1_CH16_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0015288u)

/** Alias (User Manual Name) for DMA_BLK1_CH16_CHICR.
* To use register names with standard convension, please use DMA_BLK1_CH16_CHICR.
*/
#define	DMA_CHICR116	(DMA_BLK1_CH16_CHICR)

/** \\brief  1280, DMA Channel Status Register */
#define DMA_BLK1_CH16_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0015280u)

/** Alias (User Manual Name) for DMA_BLK1_CH16_CHSR.
* To use register names with standard convension, please use DMA_BLK1_CH16_CHSR.
*/
#define	DMA_CHSR116	(DMA_BLK1_CH16_CHSR)

