HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_reg.h
/** \\brief  1294, DMA Channel Destination Address Register */
#define DMA_BLK1_CH16_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0015294u)

/** Alias (User Manual Name) for DMA_BLK1_CH16_DADR.
* To use register names with standard convension, please use DMA_BLK1_CH16_DADR.
*/
#define	DMA_DADR116	(DMA_BLK1_CH16_DADR)

/** \\brief  1290, DMA Channel Source Address Register */
#define DMA_BLK1_CH16_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0015290u)

/** Alias (User Manual Name) for DMA_BLK1_CH16_SADR.
* To use register names with standard convension, please use DMA_BLK1_CH16_SADR.
*/
#define	DMA_SADR116	(DMA_BLK1_CH16_SADR)

/** \\brief  1298, DMA Channel Shadow Address Register */
#define DMA_BLK1_CH16_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0015298u)

/** Alias (User Manual Name) for DMA_BLK1_CH16_SHADR.
* To use register names with standard convension, please use DMA_BLK1_CH16_SHADR.
*/
#define	DMA_SHADR116	(DMA_BLK1_CH16_SHADR)

/** \\brief  12AC, DMA Channel Address Control Register */
#define DMA_BLK1_CH17_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF00152ACu)

/** Alias (User Manual Name) for DMA_BLK1_CH17_ADRCR.
* To use register names with standard convension, please use DMA_BLK1_CH17_ADRCR.
*/
#define	DMA_ADRCR117	(DMA_BLK1_CH17_ADRCR)

/** \\brief  12A4, DMA Channel Control Register */
#define DMA_BLK1_CH17_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF00152A4u)

/** Alias (User Manual Name) for DMA_BLK1_CH17_CHCR.
* To use register names with standard convension, please use DMA_BLK1_CH17_CHCR.
*/
#define	DMA_CHCR117	(DMA_BLK1_CH17_CHCR)

/** \\brief  12A8, DMA Channel Interrupt Control Register */
#define DMA_BLK1_CH17_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF00152A8u)

/** Alias (User Manual Name) for DMA_BLK1_CH17_CHICR.
* To use register names with standard convension, please use DMA_BLK1_CH17_CHICR.
*/
#define	DMA_CHICR117	(DMA_BLK1_CH17_CHICR)

/** \\brief  12A0, DMA Channel Status Register */
#define DMA_BLK1_CH17_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF00152A0u)

/** Alias (User Manual Name) for DMA_BLK1_CH17_CHSR.
* To use register names with standard convension, please use DMA_BLK1_CH17_CHSR.
*/
#define	DMA_CHSR117	(DMA_BLK1_CH17_CHSR)

/** \\brief  12B4, DMA Channel Destination Address Register */
#define DMA_BLK1_CH17_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF00152B4u)

/** Alias (User Manual Name) for DMA_BLK1_CH17_DADR.
* To use register names with standard convension, please use DMA_BLK1_CH17_DADR.
*/
#define	DMA_DADR117	(DMA_BLK1_CH17_DADR)

/** \\brief  12B0, DMA Channel Source Address Register */
#define DMA_BLK1_CH17_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF00152B0u)

/** Alias (User Manual Name) for DMA_BLK1_CH17_SADR.
* To use register names with standard convension, please use DMA_BLK1_CH17_SADR.
*/
#define	DMA_SADR117	(DMA_BLK1_CH17_SADR)

/** \\brief  12B8, DMA Channel Shadow Address Register */
#define DMA_BLK1_CH17_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF00152B8u)

/** Alias (User Manual Name) for DMA_BLK1_CH17_SHADR.
* To use register names with standard convension, please use DMA_BLK1_CH17_SHADR.
*/
#define	DMA_SHADR117	(DMA_BLK1_CH17_SHADR)

/** \\brief  12CC, DMA Channel Address Control Register */
#define DMA_BLK1_CH18_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF00152CCu)

/** Alias (User Manual Name) for DMA_BLK1_CH18_ADRCR.
* To use register names with standard convension, please use DMA_BLK1_CH18_ADRCR.
*/
#define	DMA_ADRCR118	(DMA_BLK1_CH18_ADRCR)

/** \\brief  12C4, DMA Channel Control Register */
#define DMA_BLK1_CH18_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF00152C4u)

/** Alias (User Manual Name) for DMA_BLK1_CH18_CHCR.
* To use register names with standard convension, please use DMA_BLK1_CH18_CHCR.
*/
#define	DMA_CHCR118	(DMA_BLK1_CH18_CHCR)

/** \\brief  12C8, DMA Channel Interrupt Control Register */
#define DMA_BLK1_CH18_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF00152C8u)

/** Alias (User Manual Name) for DMA_BLK1_CH18_CHICR.
* To use register names with standard convension, please use DMA_BLK1_CH18_CHICR.
*/
#define	DMA_CHICR118	(DMA_BLK1_CH18_CHICR)

/** \\brief  12C0, DMA Channel Status Register */
#define DMA_BLK1_CH18_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF00152C0u)

/** Alias (User Manual Name) for DMA_BLK1_CH18_CHSR.
* To use register names with standard convension, please use DMA_BLK1_CH18_CHSR.
*/
#define	DMA_CHSR118	(DMA_BLK1_CH18_CHSR)

/** \\brief  12D4, DMA Channel Destination Address Register */
#define DMA_BLK1_CH18_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF00152D4u)

/** Alias (User Manual Name) for DMA_BLK1_CH18_DADR.
* To use register names with standard convension, please use DMA_BLK1_CH18_DADR.
*/
#define	DMA_DADR118	(DMA_BLK1_CH18_DADR)

/** \\brief  12D0, DMA Channel Source Address Register */
#define DMA_BLK1_CH18_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF00152D0u)

/** Alias (User Manual Name) for DMA_BLK1_CH18_SADR.
* To use register names with standard convension, please use DMA_BLK1_CH18_SADR.
*/
#define	DMA_SADR118	(DMA_BLK1_CH18_SADR)

/** \\brief  12D8, DMA Channel Shadow Address Register */
#define DMA_BLK1_CH18_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF00152D8u)

/** Alias (User Manual Name) for DMA_BLK1_CH18_SHADR.
* To use register names with standard convension, please use DMA_BLK1_CH18_SHADR.
*/
#define	DMA_SHADR118	(DMA_BLK1_CH18_SHADR)

/** \\brief  12EC, DMA Channel Address Control Register */
#define DMA_BLK1_CH19_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF00152ECu)

/** Alias (User Manual Name) for DMA_BLK1_CH19_ADRCR.
* To use register names with standard convension, please use DMA_BLK1_CH19_ADRCR.
*/
#define	DMA_ADRCR119	(DMA_BLK1_CH19_ADRCR)

/** \\brief  12E4, DMA Channel Control Register */
#define DMA_BLK1_CH19_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF00152E4u)

/** Alias (User Manual Name) for DMA_BLK1_CH19_CHCR.
* To use register names with standard convension, please use DMA_BLK1_CH19_CHCR.
*/
#define	DMA_CHCR119	(DMA_BLK1_CH19_CHCR)

/** \\brief  12E8, DMA Channel Interrupt Control Register */
#define DMA_BLK1_CH19_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF00152E8u)

/** Alias (User Manual Name) for DMA_BLK1_CH19_CHICR.
* To use register names with standard convension, please use DMA_BLK1_CH19_CHICR.
*/
#define	DMA_CHICR119	(DMA_BLK1_CH19_CHICR)

/** \\brief  12E0, DMA Channel Status Register */
#define DMA_BLK1_CH19_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF00152E0u)

/** Alias (User Manual Name) for DMA_BLK1_CH19_CHSR.
* To use register names with standard convension, please use DMA_BLK1_CH19_CHSR.
*/
#define	DMA_CHSR119	(DMA_BLK1_CH19_CHSR)

/** \\brief  12F4, DMA Channel Destination Address Register */
#define DMA_BLK1_CH19_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF00152F4u)

/** Alias (User Manual Name) for DMA_BLK1_CH19_DADR.
* To use register names with standard convension, please use DMA_BLK1_CH19_DADR.
*/
#define	DMA_DADR119	(DMA_BLK1_CH19_DADR)

