HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_reg.h
/** \\brief  12F0, DMA Channel Source Address Register */
#define DMA_BLK1_CH19_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF00152F0u)

/** Alias (User Manual Name) for DMA_BLK1_CH19_SADR.
* To use register names with standard convension, please use DMA_BLK1_CH19_SADR.
*/
#define	DMA_SADR119	(DMA_BLK1_CH19_SADR)

/** \\brief  12F8, DMA Channel Shadow Address Register */
#define DMA_BLK1_CH19_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF00152F8u)

/** Alias (User Manual Name) for DMA_BLK1_CH19_SHADR.
* To use register names with standard convension, please use DMA_BLK1_CH19_SHADR.
*/
#define	DMA_SHADR119	(DMA_BLK1_CH19_SHADR)

/** \\brief  10AC, DMA Channel Address Control Register */
#define DMA_BLK1_CH1_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF00150ACu)

/** Alias (User Manual Name) for DMA_BLK1_CH1_ADRCR.
* To use register names with standard convension, please use DMA_BLK1_CH1_ADRCR.
*/
#define	DMA_ADRCR101	(DMA_BLK1_CH1_ADRCR)

/** \\brief  10A4, DMA Channel Control Register */
#define DMA_BLK1_CH1_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF00150A4u)

/** Alias (User Manual Name) for DMA_BLK1_CH1_CHCR.
* To use register names with standard convension, please use DMA_BLK1_CH1_CHCR.
*/
#define	DMA_CHCR101	(DMA_BLK1_CH1_CHCR)

/** \\brief  10A8, DMA Channel Interrupt Control Register */
#define DMA_BLK1_CH1_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF00150A8u)

/** Alias (User Manual Name) for DMA_BLK1_CH1_CHICR.
* To use register names with standard convension, please use DMA_BLK1_CH1_CHICR.
*/
#define	DMA_CHICR101	(DMA_BLK1_CH1_CHICR)

/** \\brief  10A0, DMA Channel Status Register */
#define DMA_BLK1_CH1_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF00150A0u)

/** Alias (User Manual Name) for DMA_BLK1_CH1_CHSR.
* To use register names with standard convension, please use DMA_BLK1_CH1_CHSR.
*/
#define	DMA_CHSR101	(DMA_BLK1_CH1_CHSR)

/** \\brief  10B4, DMA Channel Destination Address Register */
#define DMA_BLK1_CH1_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF00150B4u)

/** Alias (User Manual Name) for DMA_BLK1_CH1_DADR.
* To use register names with standard convension, please use DMA_BLK1_CH1_DADR.
*/
#define	DMA_DADR101	(DMA_BLK1_CH1_DADR)

/** \\brief  10B0, DMA Channel Source Address Register */
#define DMA_BLK1_CH1_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF00150B0u)

/** Alias (User Manual Name) for DMA_BLK1_CH1_SADR.
* To use register names with standard convension, please use DMA_BLK1_CH1_SADR.
*/
#define	DMA_SADR101	(DMA_BLK1_CH1_SADR)

/** \\brief  10B8, DMA Channel Shadow Address Register */
#define DMA_BLK1_CH1_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF00150B8u)

/** Alias (User Manual Name) for DMA_BLK1_CH1_SHADR.
* To use register names with standard convension, please use DMA_BLK1_CH1_SHADR.
*/
#define	DMA_SHADR101	(DMA_BLK1_CH1_SHADR)

/** \\brief  130C, DMA Channel Address Control Register */
#define DMA_BLK1_CH20_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001530Cu)

/** Alias (User Manual Name) for DMA_BLK1_CH20_ADRCR.
* To use register names with standard convension, please use DMA_BLK1_CH20_ADRCR.
*/
#define	DMA_ADRCR120	(DMA_BLK1_CH20_ADRCR)

/** \\brief  1304, DMA Channel Control Register */
#define DMA_BLK1_CH20_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0015304u)

/** Alias (User Manual Name) for DMA_BLK1_CH20_CHCR.
* To use register names with standard convension, please use DMA_BLK1_CH20_CHCR.
*/
#define	DMA_CHCR120	(DMA_BLK1_CH20_CHCR)

/** \\brief  1308, DMA Channel Interrupt Control Register */
#define DMA_BLK1_CH20_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0015308u)

/** Alias (User Manual Name) for DMA_BLK1_CH20_CHICR.
* To use register names with standard convension, please use DMA_BLK1_CH20_CHICR.
*/
#define	DMA_CHICR120	(DMA_BLK1_CH20_CHICR)

/** \\brief  1300, DMA Channel Status Register */
#define DMA_BLK1_CH20_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0015300u)

/** Alias (User Manual Name) for DMA_BLK1_CH20_CHSR.
* To use register names with standard convension, please use DMA_BLK1_CH20_CHSR.
*/
#define	DMA_CHSR120	(DMA_BLK1_CH20_CHSR)

/** \\brief  1314, DMA Channel Destination Address Register */
#define DMA_BLK1_CH20_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0015314u)

/** Alias (User Manual Name) for DMA_BLK1_CH20_DADR.
* To use register names with standard convension, please use DMA_BLK1_CH20_DADR.
*/
#define	DMA_DADR120	(DMA_BLK1_CH20_DADR)

/** \\brief  1310, DMA Channel Source Address Register */
#define DMA_BLK1_CH20_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0015310u)

/** Alias (User Manual Name) for DMA_BLK1_CH20_SADR.
* To use register names with standard convension, please use DMA_BLK1_CH20_SADR.
*/
#define	DMA_SADR120	(DMA_BLK1_CH20_SADR)

/** \\brief  1318, DMA Channel Shadow Address Register */
#define DMA_BLK1_CH20_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0015318u)

/** Alias (User Manual Name) for DMA_BLK1_CH20_SHADR.
* To use register names with standard convension, please use DMA_BLK1_CH20_SHADR.
*/
#define	DMA_SHADR120	(DMA_BLK1_CH20_SHADR)

/** \\brief  132C, DMA Channel Address Control Register */
#define DMA_BLK1_CH21_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001532Cu)

/** Alias (User Manual Name) for DMA_BLK1_CH21_ADRCR.
* To use register names with standard convension, please use DMA_BLK1_CH21_ADRCR.
*/
#define	DMA_ADRCR121	(DMA_BLK1_CH21_ADRCR)

/** \\brief  1324, DMA Channel Control Register */
#define DMA_BLK1_CH21_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0015324u)

/** Alias (User Manual Name) for DMA_BLK1_CH21_CHCR.
* To use register names with standard convension, please use DMA_BLK1_CH21_CHCR.
*/
#define	DMA_CHCR121	(DMA_BLK1_CH21_CHCR)

/** \\brief  1328, DMA Channel Interrupt Control Register */
#define DMA_BLK1_CH21_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0015328u)

/** Alias (User Manual Name) for DMA_BLK1_CH21_CHICR.
* To use register names with standard convension, please use DMA_BLK1_CH21_CHICR.
*/
#define	DMA_CHICR121	(DMA_BLK1_CH21_CHICR)

