HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_reg.h
/** \\brief  1320, DMA Channel Status Register */
#define DMA_BLK1_CH21_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0015320u)

/** Alias (User Manual Name) for DMA_BLK1_CH21_CHSR.
* To use register names with standard convension, please use DMA_BLK1_CH21_CHSR.
*/
#define	DMA_CHSR121	(DMA_BLK1_CH21_CHSR)

/** \\brief  1334, DMA Channel Destination Address Register */
#define DMA_BLK1_CH21_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0015334u)

/** Alias (User Manual Name) for DMA_BLK1_CH21_DADR.
* To use register names with standard convension, please use DMA_BLK1_CH21_DADR.
*/
#define	DMA_DADR121	(DMA_BLK1_CH21_DADR)

/** \\brief  1330, DMA Channel Source Address Register */
#define DMA_BLK1_CH21_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0015330u)

/** Alias (User Manual Name) for DMA_BLK1_CH21_SADR.
* To use register names with standard convension, please use DMA_BLK1_CH21_SADR.
*/
#define	DMA_SADR121	(DMA_BLK1_CH21_SADR)

/** \\brief  1338, DMA Channel Shadow Address Register */
#define DMA_BLK1_CH21_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0015338u)

/** Alias (User Manual Name) for DMA_BLK1_CH21_SHADR.
* To use register names with standard convension, please use DMA_BLK1_CH21_SHADR.
*/
#define	DMA_SHADR121	(DMA_BLK1_CH21_SHADR)

/** \\brief  134C, DMA Channel Address Control Register */
#define DMA_BLK1_CH22_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001534Cu)

/** Alias (User Manual Name) for DMA_BLK1_CH22_ADRCR.
* To use register names with standard convension, please use DMA_BLK1_CH22_ADRCR.
*/
#define	DMA_ADRCR122	(DMA_BLK1_CH22_ADRCR)

/** \\brief  1344, DMA Channel Control Register */
#define DMA_BLK1_CH22_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0015344u)

/** Alias (User Manual Name) for DMA_BLK1_CH22_CHCR.
* To use register names with standard convension, please use DMA_BLK1_CH22_CHCR.
*/
#define	DMA_CHCR122	(DMA_BLK1_CH22_CHCR)

/** \\brief  1348, DMA Channel Interrupt Control Register */
#define DMA_BLK1_CH22_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0015348u)

/** Alias (User Manual Name) for DMA_BLK1_CH22_CHICR.
* To use register names with standard convension, please use DMA_BLK1_CH22_CHICR.
*/
#define	DMA_CHICR122	(DMA_BLK1_CH22_CHICR)

/** \\brief  1340, DMA Channel Status Register */
#define DMA_BLK1_CH22_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0015340u)

/** Alias (User Manual Name) for DMA_BLK1_CH22_CHSR.
* To use register names with standard convension, please use DMA_BLK1_CH22_CHSR.
*/
#define	DMA_CHSR122	(DMA_BLK1_CH22_CHSR)

/** \\brief  1354, DMA Channel Destination Address Register */
#define DMA_BLK1_CH22_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0015354u)

/** Alias (User Manual Name) for DMA_BLK1_CH22_DADR.
* To use register names with standard convension, please use DMA_BLK1_CH22_DADR.
*/
#define	DMA_DADR122	(DMA_BLK1_CH22_DADR)

/** \\brief  1350, DMA Channel Source Address Register */
#define DMA_BLK1_CH22_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0015350u)

/** Alias (User Manual Name) for DMA_BLK1_CH22_SADR.
* To use register names with standard convension, please use DMA_BLK1_CH22_SADR.
*/
#define	DMA_SADR122	(DMA_BLK1_CH22_SADR)

/** \\brief  1358, DMA Channel Shadow Address Register */
#define DMA_BLK1_CH22_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0015358u)

/** Alias (User Manual Name) for DMA_BLK1_CH22_SHADR.
* To use register names with standard convension, please use DMA_BLK1_CH22_SHADR.
*/
#define	DMA_SHADR122	(DMA_BLK1_CH22_SHADR)

/** \\brief  136C, DMA Channel Address Control Register */
#define DMA_BLK1_CH23_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001536Cu)

/** Alias (User Manual Name) for DMA_BLK1_CH23_ADRCR.
* To use register names with standard convension, please use DMA_BLK1_CH23_ADRCR.
*/
#define	DMA_ADRCR123	(DMA_BLK1_CH23_ADRCR)

/** \\brief  1364, DMA Channel Control Register */
#define DMA_BLK1_CH23_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0015364u)

/** Alias (User Manual Name) for DMA_BLK1_CH23_CHCR.
* To use register names with standard convension, please use DMA_BLK1_CH23_CHCR.
*/
#define	DMA_CHCR123	(DMA_BLK1_CH23_CHCR)

/** \\brief  1368, DMA Channel Interrupt Control Register */
#define DMA_BLK1_CH23_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0015368u)

/** Alias (User Manual Name) for DMA_BLK1_CH23_CHICR.
* To use register names with standard convension, please use DMA_BLK1_CH23_CHICR.
*/
#define	DMA_CHICR123	(DMA_BLK1_CH23_CHICR)

/** \\brief  1360, DMA Channel Status Register */
#define DMA_BLK1_CH23_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0015360u)

/** Alias (User Manual Name) for DMA_BLK1_CH23_CHSR.
* To use register names with standard convension, please use DMA_BLK1_CH23_CHSR.
*/
#define	DMA_CHSR123	(DMA_BLK1_CH23_CHSR)

/** \\brief  1374, DMA Channel Destination Address Register */
#define DMA_BLK1_CH23_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0015374u)

/** Alias (User Manual Name) for DMA_BLK1_CH23_DADR.
* To use register names with standard convension, please use DMA_BLK1_CH23_DADR.
*/
#define	DMA_DADR123	(DMA_BLK1_CH23_DADR)

/** \\brief  1370, DMA Channel Source Address Register */
#define DMA_BLK1_CH23_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0015370u)

/** Alias (User Manual Name) for DMA_BLK1_CH23_SADR.
* To use register names with standard convension, please use DMA_BLK1_CH23_SADR.
*/
#define	DMA_SADR123	(DMA_BLK1_CH23_SADR)

/** \\brief  1378, DMA Channel Shadow Address Register */
#define DMA_BLK1_CH23_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0015378u)

/** Alias (User Manual Name) for DMA_BLK1_CH23_SHADR.
* To use register names with standard convension, please use DMA_BLK1_CH23_SHADR.
*/
#define	DMA_SHADR123	(DMA_BLK1_CH23_SHADR)

/** \\brief  10CC, DMA Channel Address Control Register */
#define DMA_BLK1_CH2_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF00150CCu)

/** Alias (User Manual Name) for DMA_BLK1_CH2_ADRCR.
* To use register names with standard convension, please use DMA_BLK1_CH2_ADRCR.
*/
#define	DMA_ADRCR102	(DMA_BLK1_CH2_ADRCR)

