HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_reg.h
/** \\brief  10C4, DMA Channel Control Register */
#define DMA_BLK1_CH2_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF00150C4u)

/** Alias (User Manual Name) for DMA_BLK1_CH2_CHCR.
* To use register names with standard convension, please use DMA_BLK1_CH2_CHCR.
*/
#define	DMA_CHCR102	(DMA_BLK1_CH2_CHCR)

/** \\brief  10C8, DMA Channel Interrupt Control Register */
#define DMA_BLK1_CH2_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF00150C8u)

/** Alias (User Manual Name) for DMA_BLK1_CH2_CHICR.
* To use register names with standard convension, please use DMA_BLK1_CH2_CHICR.
*/
#define	DMA_CHICR102	(DMA_BLK1_CH2_CHICR)

/** \\brief  10C0, DMA Channel Status Register */
#define DMA_BLK1_CH2_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF00150C0u)

/** Alias (User Manual Name) for DMA_BLK1_CH2_CHSR.
* To use register names with standard convension, please use DMA_BLK1_CH2_CHSR.
*/
#define	DMA_CHSR102	(DMA_BLK1_CH2_CHSR)

/** \\brief  10D4, DMA Channel Destination Address Register */
#define DMA_BLK1_CH2_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF00150D4u)

/** Alias (User Manual Name) for DMA_BLK1_CH2_DADR.
* To use register names with standard convension, please use DMA_BLK1_CH2_DADR.
*/
#define	DMA_DADR102	(DMA_BLK1_CH2_DADR)

/** \\brief  10D0, DMA Channel Source Address Register */
#define DMA_BLK1_CH2_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF00150D0u)

/** Alias (User Manual Name) for DMA_BLK1_CH2_SADR.
* To use register names with standard convension, please use DMA_BLK1_CH2_SADR.
*/
#define	DMA_SADR102	(DMA_BLK1_CH2_SADR)

/** \\brief  10D8, DMA Channel Shadow Address Register */
#define DMA_BLK1_CH2_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF00150D8u)

/** Alias (User Manual Name) for DMA_BLK1_CH2_SHADR.
* To use register names with standard convension, please use DMA_BLK1_CH2_SHADR.
*/
#define	DMA_SHADR102	(DMA_BLK1_CH2_SHADR)

/** \\brief  10EC, DMA Channel Address Control Register */
#define DMA_BLK1_CH3_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF00150ECu)

/** Alias (User Manual Name) for DMA_BLK1_CH3_ADRCR.
* To use register names with standard convension, please use DMA_BLK1_CH3_ADRCR.
*/
#define	DMA_ADRCR103	(DMA_BLK1_CH3_ADRCR)

/** \\brief  10E4, DMA Channel Control Register */
#define DMA_BLK1_CH3_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF00150E4u)

/** Alias (User Manual Name) for DMA_BLK1_CH3_CHCR.
* To use register names with standard convension, please use DMA_BLK1_CH3_CHCR.
*/
#define	DMA_CHCR103	(DMA_BLK1_CH3_CHCR)

/** \\brief  10E8, DMA Channel Interrupt Control Register */
#define DMA_BLK1_CH3_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF00150E8u)

/** Alias (User Manual Name) for DMA_BLK1_CH3_CHICR.
* To use register names with standard convension, please use DMA_BLK1_CH3_CHICR.
*/
#define	DMA_CHICR103	(DMA_BLK1_CH3_CHICR)

/** \\brief  10E0, DMA Channel Status Register */
#define DMA_BLK1_CH3_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF00150E0u)

/** Alias (User Manual Name) for DMA_BLK1_CH3_CHSR.
* To use register names with standard convension, please use DMA_BLK1_CH3_CHSR.
*/
#define	DMA_CHSR103	(DMA_BLK1_CH3_CHSR)

/** \\brief  10F4, DMA Channel Destination Address Register */
#define DMA_BLK1_CH3_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF00150F4u)

/** Alias (User Manual Name) for DMA_BLK1_CH3_DADR.
* To use register names with standard convension, please use DMA_BLK1_CH3_DADR.
*/
#define	DMA_DADR103	(DMA_BLK1_CH3_DADR)

/** \\brief  10F0, DMA Channel Source Address Register */
#define DMA_BLK1_CH3_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF00150F0u)

/** Alias (User Manual Name) for DMA_BLK1_CH3_SADR.
* To use register names with standard convension, please use DMA_BLK1_CH3_SADR.
*/
#define	DMA_SADR103	(DMA_BLK1_CH3_SADR)

/** \\brief  10F8, DMA Channel Shadow Address Register */
#define DMA_BLK1_CH3_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF00150F8u)

/** Alias (User Manual Name) for DMA_BLK1_CH3_SHADR.
* To use register names with standard convension, please use DMA_BLK1_CH3_SHADR.
*/
#define	DMA_SHADR103	(DMA_BLK1_CH3_SHADR)

/** \\brief  110C, DMA Channel Address Control Register */
#define DMA_BLK1_CH4_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001510Cu)

/** Alias (User Manual Name) for DMA_BLK1_CH4_ADRCR.
* To use register names with standard convension, please use DMA_BLK1_CH4_ADRCR.
*/
#define	DMA_ADRCR104	(DMA_BLK1_CH4_ADRCR)

/** \\brief  1104, DMA Channel Control Register */
#define DMA_BLK1_CH4_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0015104u)

/** Alias (User Manual Name) for DMA_BLK1_CH4_CHCR.
* To use register names with standard convension, please use DMA_BLK1_CH4_CHCR.
*/
#define	DMA_CHCR104	(DMA_BLK1_CH4_CHCR)

/** \\brief  1108, DMA Channel Interrupt Control Register */
#define DMA_BLK1_CH4_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0015108u)

/** Alias (User Manual Name) for DMA_BLK1_CH4_CHICR.
* To use register names with standard convension, please use DMA_BLK1_CH4_CHICR.
*/
#define	DMA_CHICR104	(DMA_BLK1_CH4_CHICR)

/** \\brief  1100, DMA Channel Status Register */
#define DMA_BLK1_CH4_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0015100u)

/** Alias (User Manual Name) for DMA_BLK1_CH4_CHSR.
* To use register names with standard convension, please use DMA_BLK1_CH4_CHSR.
*/
#define	DMA_CHSR104	(DMA_BLK1_CH4_CHSR)

/** \\brief  1114, DMA Channel Destination Address Register */
#define DMA_BLK1_CH4_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0015114u)

/** Alias (User Manual Name) for DMA_BLK1_CH4_DADR.
* To use register names with standard convension, please use DMA_BLK1_CH4_DADR.
*/
#define	DMA_DADR104	(DMA_BLK1_CH4_DADR)

/** \\brief  1110, DMA Channel Source Address Register */
#define DMA_BLK1_CH4_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0015110u)

