HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_BLK1_CH4_SADR.
* To use register names with standard convension, please use DMA_BLK1_CH4_SADR.
*/
#define	DMA_SADR104	(DMA_BLK1_CH4_SADR)

/** \\brief  1118, DMA Channel Shadow Address Register */
#define DMA_BLK1_CH4_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0015118u)

/** Alias (User Manual Name) for DMA_BLK1_CH4_SHADR.
* To use register names with standard convension, please use DMA_BLK1_CH4_SHADR.
*/
#define	DMA_SHADR104	(DMA_BLK1_CH4_SHADR)

/** \\brief  112C, DMA Channel Address Control Register */
#define DMA_BLK1_CH5_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001512Cu)

/** Alias (User Manual Name) for DMA_BLK1_CH5_ADRCR.
* To use register names with standard convension, please use DMA_BLK1_CH5_ADRCR.
*/
#define	DMA_ADRCR105	(DMA_BLK1_CH5_ADRCR)

/** \\brief  1124, DMA Channel Control Register */
#define DMA_BLK1_CH5_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0015124u)

/** Alias (User Manual Name) for DMA_BLK1_CH5_CHCR.
* To use register names with standard convension, please use DMA_BLK1_CH5_CHCR.
*/
#define	DMA_CHCR105	(DMA_BLK1_CH5_CHCR)

/** \\brief  1128, DMA Channel Interrupt Control Register */
#define DMA_BLK1_CH5_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0015128u)

/** Alias (User Manual Name) for DMA_BLK1_CH5_CHICR.
* To use register names with standard convension, please use DMA_BLK1_CH5_CHICR.
*/
#define	DMA_CHICR105	(DMA_BLK1_CH5_CHICR)

/** \\brief  1120, DMA Channel Status Register */
#define DMA_BLK1_CH5_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0015120u)

/** Alias (User Manual Name) for DMA_BLK1_CH5_CHSR.
* To use register names with standard convension, please use DMA_BLK1_CH5_CHSR.
*/
#define	DMA_CHSR105	(DMA_BLK1_CH5_CHSR)

/** \\brief  1134, DMA Channel Destination Address Register */
#define DMA_BLK1_CH5_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0015134u)

/** Alias (User Manual Name) for DMA_BLK1_CH5_DADR.
* To use register names with standard convension, please use DMA_BLK1_CH5_DADR.
*/
#define	DMA_DADR105	(DMA_BLK1_CH5_DADR)

/** \\brief  1130, DMA Channel Source Address Register */
#define DMA_BLK1_CH5_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0015130u)

/** Alias (User Manual Name) for DMA_BLK1_CH5_SADR.
* To use register names with standard convension, please use DMA_BLK1_CH5_SADR.
*/
#define	DMA_SADR105	(DMA_BLK1_CH5_SADR)

/** \\brief  1138, DMA Channel Shadow Address Register */
#define DMA_BLK1_CH5_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0015138u)

/** Alias (User Manual Name) for DMA_BLK1_CH5_SHADR.
* To use register names with standard convension, please use DMA_BLK1_CH5_SHADR.
*/
#define	DMA_SHADR105	(DMA_BLK1_CH5_SHADR)

/** \\brief  114C, DMA Channel Address Control Register */
#define DMA_BLK1_CH6_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001514Cu)

/** Alias (User Manual Name) for DMA_BLK1_CH6_ADRCR.
* To use register names with standard convension, please use DMA_BLK1_CH6_ADRCR.
*/
#define	DMA_ADRCR106	(DMA_BLK1_CH6_ADRCR)

/** \\brief  1144, DMA Channel Control Register */
#define DMA_BLK1_CH6_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0015144u)

/** Alias (User Manual Name) for DMA_BLK1_CH6_CHCR.
* To use register names with standard convension, please use DMA_BLK1_CH6_CHCR.
*/
#define	DMA_CHCR106	(DMA_BLK1_CH6_CHCR)

/** \\brief  1148, DMA Channel Interrupt Control Register */
#define DMA_BLK1_CH6_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0015148u)

/** Alias (User Manual Name) for DMA_BLK1_CH6_CHICR.
* To use register names with standard convension, please use DMA_BLK1_CH6_CHICR.
*/
#define	DMA_CHICR106	(DMA_BLK1_CH6_CHICR)

/** \\brief  1140, DMA Channel Status Register */
#define DMA_BLK1_CH6_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0015140u)

/** Alias (User Manual Name) for DMA_BLK1_CH6_CHSR.
* To use register names with standard convension, please use DMA_BLK1_CH6_CHSR.
*/
#define	DMA_CHSR106	(DMA_BLK1_CH6_CHSR)

/** \\brief  1154, DMA Channel Destination Address Register */
#define DMA_BLK1_CH6_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0015154u)

/** Alias (User Manual Name) for DMA_BLK1_CH6_DADR.
* To use register names with standard convension, please use DMA_BLK1_CH6_DADR.
*/
#define	DMA_DADR106	(DMA_BLK1_CH6_DADR)

/** \\brief  1150, DMA Channel Source Address Register */
#define DMA_BLK1_CH6_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0015150u)

/** Alias (User Manual Name) for DMA_BLK1_CH6_SADR.
* To use register names with standard convension, please use DMA_BLK1_CH6_SADR.
*/
#define	DMA_SADR106	(DMA_BLK1_CH6_SADR)

/** \\brief  1158, DMA Channel Shadow Address Register */
#define DMA_BLK1_CH6_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0015158u)

/** Alias (User Manual Name) for DMA_BLK1_CH6_SHADR.
* To use register names with standard convension, please use DMA_BLK1_CH6_SHADR.
*/
#define	DMA_SHADR106	(DMA_BLK1_CH6_SHADR)

/** \\brief  116C, DMA Channel Address Control Register */
#define DMA_BLK1_CH7_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001516Cu)

/** Alias (User Manual Name) for DMA_BLK1_CH7_ADRCR.
* To use register names with standard convension, please use DMA_BLK1_CH7_ADRCR.
*/
#define	DMA_ADRCR107	(DMA_BLK1_CH7_ADRCR)

/** \\brief  1164, DMA Channel Control Register */
#define DMA_BLK1_CH7_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0015164u)

/** Alias (User Manual Name) for DMA_BLK1_CH7_CHCR.
* To use register names with standard convension, please use DMA_BLK1_CH7_CHCR.
*/
#define	DMA_CHCR107	(DMA_BLK1_CH7_CHCR)

/** \\brief  1168, DMA Channel Interrupt Control Register */
#define DMA_BLK1_CH7_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0015168u)

/** Alias (User Manual Name) for DMA_BLK1_CH7_CHICR.
* To use register names with standard convension, please use DMA_BLK1_CH7_CHICR.
*/
#define	DMA_CHICR107	(DMA_BLK1_CH7_CHICR)

/** \\brief  1160, DMA Channel Status Register */
#define DMA_BLK1_CH7_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0015160u)

