HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_BLK1_CH7_CHSR.
* To use register names with standard convension, please use DMA_BLK1_CH7_CHSR.
*/
#define	DMA_CHSR107	(DMA_BLK1_CH7_CHSR)

/** \\brief  1174, DMA Channel Destination Address Register */
#define DMA_BLK1_CH7_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0015174u)

/** Alias (User Manual Name) for DMA_BLK1_CH7_DADR.
* To use register names with standard convension, please use DMA_BLK1_CH7_DADR.
*/
#define	DMA_DADR107	(DMA_BLK1_CH7_DADR)

/** \\brief  1170, DMA Channel Source Address Register */
#define DMA_BLK1_CH7_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0015170u)

/** Alias (User Manual Name) for DMA_BLK1_CH7_SADR.
* To use register names with standard convension, please use DMA_BLK1_CH7_SADR.
*/
#define	DMA_SADR107	(DMA_BLK1_CH7_SADR)

/** \\brief  1178, DMA Channel Shadow Address Register */
#define DMA_BLK1_CH7_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0015178u)

/** Alias (User Manual Name) for DMA_BLK1_CH7_SHADR.
* To use register names with standard convension, please use DMA_BLK1_CH7_SHADR.
*/
#define	DMA_SHADR107	(DMA_BLK1_CH7_SHADR)

/** \\brief  118C, DMA Channel Address Control Register */
#define DMA_BLK1_CH8_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF001518Cu)

/** Alias (User Manual Name) for DMA_BLK1_CH8_ADRCR.
* To use register names with standard convension, please use DMA_BLK1_CH8_ADRCR.
*/
#define	DMA_ADRCR108	(DMA_BLK1_CH8_ADRCR)

/** \\brief  1184, DMA Channel Control Register */
#define DMA_BLK1_CH8_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF0015184u)

/** Alias (User Manual Name) for DMA_BLK1_CH8_CHCR.
* To use register names with standard convension, please use DMA_BLK1_CH8_CHCR.
*/
#define	DMA_CHCR108	(DMA_BLK1_CH8_CHCR)

/** \\brief  1188, DMA Channel Interrupt Control Register */
#define DMA_BLK1_CH8_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF0015188u)

/** Alias (User Manual Name) for DMA_BLK1_CH8_CHICR.
* To use register names with standard convension, please use DMA_BLK1_CH8_CHICR.
*/
#define	DMA_CHICR108	(DMA_BLK1_CH8_CHICR)

/** \\brief  1180, DMA Channel Status Register */
#define DMA_BLK1_CH8_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF0015180u)

/** Alias (User Manual Name) for DMA_BLK1_CH8_CHSR.
* To use register names with standard convension, please use DMA_BLK1_CH8_CHSR.
*/
#define	DMA_CHSR108	(DMA_BLK1_CH8_CHSR)

/** \\brief  1194, DMA Channel Destination Address Register */
#define DMA_BLK1_CH8_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF0015194u)

/** Alias (User Manual Name) for DMA_BLK1_CH8_DADR.
* To use register names with standard convension, please use DMA_BLK1_CH8_DADR.
*/
#define	DMA_DADR108	(DMA_BLK1_CH8_DADR)

/** \\brief  1190, DMA Channel Source Address Register */
#define DMA_BLK1_CH8_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF0015190u)

/** Alias (User Manual Name) for DMA_BLK1_CH8_SADR.
* To use register names with standard convension, please use DMA_BLK1_CH8_SADR.
*/
#define	DMA_SADR108	(DMA_BLK1_CH8_SADR)

/** \\brief  1198, DMA Channel Shadow Address Register */
#define DMA_BLK1_CH8_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF0015198u)

/** Alias (User Manual Name) for DMA_BLK1_CH8_SHADR.
* To use register names with standard convension, please use DMA_BLK1_CH8_SHADR.
*/
#define	DMA_SHADR108	(DMA_BLK1_CH8_SHADR)

/** \\brief  11AC, DMA Channel Address Control Register */
#define DMA_BLK1_CH9_ADRCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_ADRCR*)0xF00151ACu)

/** Alias (User Manual Name) for DMA_BLK1_CH9_ADRCR.
* To use register names with standard convension, please use DMA_BLK1_CH9_ADRCR.
*/
#define	DMA_ADRCR109	(DMA_BLK1_CH9_ADRCR)

/** \\brief  11A4, DMA Channel Control Register */
#define DMA_BLK1_CH9_CHCR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHCR*)0xF00151A4u)

/** Alias (User Manual Name) for DMA_BLK1_CH9_CHCR.
* To use register names with standard convension, please use DMA_BLK1_CH9_CHCR.
*/
#define	DMA_CHCR109	(DMA_BLK1_CH9_CHCR)

/** \\brief  11A8, DMA Channel Interrupt Control Register */
#define DMA_BLK1_CH9_CHICR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHICR*)0xF00151A8u)

/** Alias (User Manual Name) for DMA_BLK1_CH9_CHICR.
* To use register names with standard convension, please use DMA_BLK1_CH9_CHICR.
*/
#define	DMA_CHICR109	(DMA_BLK1_CH9_CHICR)

/** \\brief  11A0, DMA Channel Status Register */
#define DMA_BLK1_CH9_CHSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_CHSR*)0xF00151A0u)

/** Alias (User Manual Name) for DMA_BLK1_CH9_CHSR.
* To use register names with standard convension, please use DMA_BLK1_CH9_CHSR.
*/
#define	DMA_CHSR109	(DMA_BLK1_CH9_CHSR)

/** \\brief  11B4, DMA Channel Destination Address Register */
#define DMA_BLK1_CH9_DADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_DADR*)0xF00151B4u)

/** Alias (User Manual Name) for DMA_BLK1_CH9_DADR.
* To use register names with standard convension, please use DMA_BLK1_CH9_DADR.
*/
#define	DMA_DADR109	(DMA_BLK1_CH9_DADR)

/** \\brief  11B0, DMA Channel Source Address Register */
#define DMA_BLK1_CH9_SADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SADR*)0xF00151B0u)

/** Alias (User Manual Name) for DMA_BLK1_CH9_SADR.
* To use register names with standard convension, please use DMA_BLK1_CH9_SADR.
*/
#define	DMA_SADR109	(DMA_BLK1_CH9_SADR)

/** \\brief  11B8, DMA Channel Shadow Address Register */
#define DMA_BLK1_CH9_SHADR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CH_SHADR*)0xF00151B8u)

/** Alias (User Manual Name) for DMA_BLK1_CH9_SHADR.
* To use register names with standard convension, please use DMA_BLK1_CH9_SHADR.
*/
#define	DMA_SHADR109	(DMA_BLK1_CH9_SHADR)

/** \\brief  1070, DMA Channel Interrupt Set Register0 */
#define DMA_BLK1_CHINTR0 /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CHINTR0*)0xF0015070u)

/** Alias (User Manual Name) for DMA_BLK1_CHINTR0.
* To use register names with standard convension, please use DMA_BLK1_CHINTR0.
*/
#define	DMA_CHINTR10	(DMA_BLK1_CHINTR0)

/** \\brief  1040, DMA Channel Reset Request Register0 */
#define DMA_BLK1_CHRSTR0 /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CHRSTR0*)0xF0015040u)

