HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxDma_reg.h
/** Alias (User Manual Name) for DMA_BLK1_CHRSTR0.
* To use register names with standard convension, please use DMA_BLK1_CHRSTR0.
*/
#define	DMA_CHRSTR10	(DMA_BLK1_CHRSTR0)

/** \\brief  1028, DMA Clear Error Register */
#define DMA_BLK1_CLRE /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_CLRE*)0xF0015028u)

/** Alias (User Manual Name) for DMA_BLK1_CLRE.
* To use register names with standard convension, please use DMA_BLK1_CLRE.
*/
#define	DMA_CLRE1	(DMA_BLK1_CLRE)

/** \\brief  1020, DMA Enable Error Register */
#define DMA_BLK1_EER /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_EER*)0xF0015020u)

/** Alias (User Manual Name) for DMA_BLK1_EER.
* To use register names with standard convension, please use DMA_BLK1_EER.
*/
#define	DMA_EER1	(DMA_BLK1_EER)

/** \\brief  1024, DMA Error Status Register */
#define DMA_BLK1_ERRSR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_ERRSR*)0xF0015024u)

/** Alias (User Manual Name) for DMA_BLK1_ERRSR.
* To use register names with standard convension, please use DMA_BLK1_ERRSR.
*/
#define	DMA_ERRSR1	(DMA_BLK1_ERRSR)

/** \\brief  1038, DMA Move Engine Interrupt Set Register */
#define DMA_BLK1_ME_INTR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_ME_INTR*)0xF0015038u)

/** Alias (User Manual Name) for DMA_BLK1_ME_INTR.
* To use register names with standard convension, please use DMA_BLK1_ME_INTR.
*/
#define	DMA_ME1INTR	(DMA_BLK1_ME_INTR)

/** \\brief  103C, DMA Move Engine Pattern Read Register */
#define DMA_BLK1_ME_PR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_ME_PR*)0xF001503Cu)

/** Alias (User Manual Name) for DMA_BLK1_ME_PR.
* To use register names with standard convension, please use DMA_BLK1_ME_PR.
*/
#define	DMA_ME1PR	(DMA_BLK1_ME_PR)

/** \\brief  1034, DMA Move Engine Read Register */
#define DMA_BLK1_ME_R /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_ME_R*)0xF0015034u)

/** Alias (User Manual Name) for DMA_BLK1_ME_R.
* To use register names with standard convension, please use DMA_BLK1_ME_R.
*/
#define	DMA_ME1R	(DMA_BLK1_ME_R)

/** \\brief  1030, DMA Move Engine Status Register */
#define DMA_BLK1_ME_SR /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_ME_SR*)0xF0015030u)

/** Alias (User Manual Name) for DMA_BLK1_ME_SR.
* To use register names with standard convension, please use DMA_BLK1_ME_SR.
*/
#define	DMA_ME1SR	(DMA_BLK1_ME_SR)

/** \\brief  1068, DMA Suspend Acknowledge Register0 */
#define DMA_BLK1_SUSACR0 /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_SUSACR0*)0xF0015068u)

/** Alias (User Manual Name) for DMA_BLK1_SUSACR0.
* To use register names with standard convension, please use DMA_BLK1_SUSACR0.
*/
#define	DMA_SUSACR10	(DMA_BLK1_SUSACR0)

/** \\brief  1060, DMA Suspend Enable Register0 */
#define DMA_BLK1_SUSENR0 /*lint --e(923)*/ (*(volatile Ifx_DMA_BLK_SUSENR0*)0xF0015060u)

/** Alias (User Manual Name) for DMA_BLK1_SUSENR0.
* To use register names with standard convension, please use DMA_BLK1_SUSENR0.
*/
#define	DMA_SUSENR10	(DMA_BLK1_SUSENR0)

/** \\brief  0, DMA Sub-block 0 Clock Control Register */
#define DMA_CLC0 /*lint --e(923)*/ (*(volatile Ifx_DMA_CLC0*)0xF0014000u)

/** \\brief  1000, DMA Sub-block 1 Clock Control Register */
#define DMA_CLC1 /*lint --e(923)*/ (*(volatile Ifx_DMA_CLC1*)0xF0015000u)

/** \\brief  8, Module Identification Register */
#define DMA_ID /*lint --e(923)*/ (*(volatile Ifx_DMA_ID*)0xF0014008u)

/** \\brief  C, DMA OCDS Trigger Set Select */
#define DMA_OTSS /*lint --e(923)*/ (*(volatile Ifx_DMA_OTSS*)0xF001400Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXDMA_REG_H */
